TheEccentricGenius/PRODUINO-INK-4u-Software/boards.txt
avrda.name=AVR DA-series (no bootloader)
avrdb.name=AVR DB-series (no bootloader)
avrdd.name=AVR DD-series (no bootloader)
#avrdu.name=AVR DU-series (no bootloader)
avrea.name=AVR EA-series (no bootloader)
#avreb.name=AVR EB-series (no bootloader)
produinoink4u.name=Produino INK 4u (no bootloader)
avrdaopti.name=AVR DA-series (Optiboot)
avrdbopti.name=AVR DB-series (Optiboot)
avrddopti.name=AVR DD-series (Optiboot)
#avrduopti.name=AVR DU-series (Optiboot)
#avrduusb.name=AVR DU-series with USB Bootloader TBD.
#avreaopti.name=AVR EA-series (Optiboot)
#avrebopti.name=AVR EB-series (Optiboot)
azduinoboard.name=Azduino Boards (Optiboot)
produinoink4uopti.name=Produino INK 4u (Optiboot)


##########################################################################
#                                                                        #
###                 ###  #     # ####      ####   ###                  ###
#####              #   # #     # #   #     #   # #   #               #####
#######            #####  #   #  ####  ### #   # #####             #######
#####              #   #   # #   # #       #   # #   #               #####
###                #   #    #    #  #      ####  #   #                 ###
#________________________________________________________________________#
#                                        #
# Parameters and defaults for DA parts   #
#________________________________________#
avrda.upload.tool=avrdude
avrda.upload.prog_interlock=
avrda.build.board=avrda
avrda.build.core=dxcore
avrda.upload.maximum_size=0
avrda.upload.maximum_data_size=0
# The maximum size and data size attributes are overridden by the selected chip. If you are avoiding specifying that somehow, there is no hope of anything working, so don't do that.
# Each top-level entry supports at least a dozen parts with varying memory constraints.
avrda.build.f_cpu={build.speed}000000L
avrda.build.text_section_start=.text=0x0
avrda.build.extra_flags= {bootloader.appspm}
avrda.build.export_merged_output=false
avrda.build.printf=
avrda.build.flmapopts=
avrda.build.attachmode=-DCORE_ATTACH_ALL

#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrda.bootloader.tool=avrdude
avrda.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
avrda.bootloader.wdtwindowbits=0000
avrda.bootloader.wdttimeotbits=0000
avrda.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrda.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrda.bootloader.CODESIZE=0x00
avrda.bootloader.BOOTSIZE=0x01
# Note that BOOTSIZE is overridden by App SPM menu's default option - this way is just less verbose.
avrda.bootloader.avrdudestring=
avrda.bootloader.pymcuprogstring=-aerase

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
avrda.build.mcupostfix=
avrda.build.printfabr=
avrda.build.attachabr=
avrda.build.wireabr=
avrda.build.flmapabr=.ful
avrda.build.appspmabr=.spm{bootloader.CODESIZE}

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DA submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
#________________________________________#
avrda.menu.chip.avr128da28=AVR128DA28
avrda.menu.chip.avr128da28.build.mcu=avr128da28
avrda.menu.chip.avr128da28.upload.maximum_size=131072
avrda.menu.chip.avr128da28.upload.maximum_data_size=16384
avrda.menu.chip.avr128da28.build.variant=28pin-standard
avrda.menu.chip.avr128da32=AVR128DA32
avrda.menu.chip.avr128da32.build.mcu=avr128da32
avrda.menu.chip.avr128da32.upload.maximum_size=131072
avrda.menu.chip.avr128da32.upload.maximum_data_size=16384
avrda.menu.chip.avr128da32.build.variant=32pin-standard
avrda.menu.chip.avr128da48=AVR128DA48
avrda.menu.chip.avr128da48.build.mcu=avr128da48
avrda.menu.chip.avr128da48.upload.maximum_size=131072
avrda.menu.chip.avr128da48.upload.maximum_data_size=16384
avrda.menu.chip.avr128da48.build.variant=48pin-standard
avrda.menu.chip.avr128da64=AVR128DA64
avrda.menu.chip.avr128da64.build.mcu=avr128da64
avrda.menu.chip.avr128da64.upload.maximum_size=131072
avrda.menu.chip.avr128da64.upload.maximum_data_size=16384
avrda.menu.chip.avr128da64.build.variant=64pin-standard
avrda.menu.chip.avr64da28=AVR64DA28
avrda.menu.chip.avr64da28.build.mcu=avr64da28
avrda.menu.chip.avr64da28.upload.maximum_size=65536
avrda.menu.chip.avr64da28.upload.maximum_data_size=8192
avrda.menu.chip.avr64da28.build.variant=28pin-standard
avrda.menu.chip.avr64da32=AVR64DA32
avrda.menu.chip.avr64da32.build.mcu=avr64da32
avrda.menu.chip.avr64da32.upload.maximum_size=65536
avrda.menu.chip.avr64da32.upload.maximum_data_size=8192
avrda.menu.chip.avr64da32.build.variant=32pin-standard
avrda.menu.chip.avr64da48=AVR64DA48
avrda.menu.chip.avr64da48.build.mcu=avr64da48
avrda.menu.chip.avr64da48.upload.maximum_size=65536
avrda.menu.chip.avr64da48.upload.maximum_data_size=8192
avrda.menu.chip.avr64da48.build.variant=48pin-standard
avrda.menu.chip.avr64da64=AVR64DA64
avrda.menu.chip.avr64da64.build.mcu=avr64da64
avrda.menu.chip.avr64da64.upload.maximum_size=65536
avrda.menu.chip.avr64da64.upload.maximum_data_size=8192
avrda.menu.chip.avr64da64.build.variant=64pin-standard
avrda.menu.chip.avr32da28=AVR32DA28
avrda.menu.chip.avr32da28.build.mcu=avr32da28
avrda.menu.chip.avr32da28.upload.maximum_size=32768
avrda.menu.chip.avr32da28.upload.maximum_data_size=4096
avrda.menu.chip.avr32da28.build.variant=28pin-standard
avrda.menu.chip.avr32da32=AVR32DA32
avrda.menu.chip.avr32da32.build.mcu=avr32da32
avrda.menu.chip.avr32da32.upload.maximum_size=32768
avrda.menu.chip.avr32da32.upload.maximum_data_size=4096
avrda.menu.chip.avr32da32.build.variant=32pin-standard
avrda.menu.chip.avr32da48=AVR32DA48
avrda.menu.chip.avr32da48.build.mcu=avr32da48
avrda.menu.chip.avr32da48.upload.maximum_size=32768
avrda.menu.chip.avr32da48.upload.maximum_data_size=4096
avrda.menu.chip.avr32da48.build.variant=48pin-standard

