TheEccentricGenius/PRODUINO-INK-4u-Software/boards.txt
#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avrdb.menu.WDTtimeout.disabled=Disabled (recommended)
avrdb.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avrdb.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avrdb.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avrdb.menu.WDTtimeout.1second=Window remains open for 1 Second
avrdb.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avrdb.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avrdb.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avrdb.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avrdb.menu.WDTwindow.disabled=No delay before window "opens"
avrdb.menu.WDTwindow.8seconds=8 Second before window "opens"
avrdb.menu.WDTwindow.4seconds=4 Second before window "opens"
avrdb.menu.WDTwindow.2seconds=2 Second before window "opens"
avrdb.menu.WDTwindow.1second=1 Second before window "opens"
avrdb.menu.WDTwindow.500msec=500 millisecond before window "opens"
avrdb.menu.WDTwindow.250msec=250 millisecond before window "opens"
avrdb.menu.WDTwindow.125msec=125 millisecond before window "opens"
avrdb.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avrdb.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avrdb.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avrdb.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avrdb.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avrdb.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avrdb.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avrdb.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avrdb.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avrdb.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avrdb.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avrdb.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avrdb.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avrdb.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avrdb.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avrdb.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avrdb.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avrdb.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avrdb.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

#----------------------------------------#
# Flash Mapping options                  #
#________________________________________#
avrdb.menu.flmap.lockdefault=Use last FLMAP section, lock FLMAP, provide PROGMEM_MAPPED
avrdb.menu.flmap.unlocked=Start w/default, do not lock flmap. No PROGMEM_MAPPED.
avrdb.menu.flmap.locksection02=Set FLMAP to section 2, lock FLMAP, provide PROGMEM_MAPPED
avrdb.menu.flmap.locksection1=Set FLMAP to section 1, lock FLMAP, provide PROGMEM_MAPPED
avrdb.menu.flmap.locksection0=Set FLMAP to section 0, lock FLMAP, provide PROGMEM_MAPPED
avrdb.menu.flmap.lockdefault.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION3
avrdb.menu.flmap.unlocked.build.flmapopts=
avrdb.menu.flmap.locksection02.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION2
avrdb.menu.flmap.locksection1.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION1
avrdb.menu.flmap.locksection0.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION0
avrdb.menu.flmap.lockdefault.build.flmapabr=.fld
avrdb.menu.flmap.unlocked.build.flmapabr=.ful
avrdb.menu.flmap.locksection02.build.flmapabr=.fl2
avrdb.menu.flmap.locksection1.build.flmapabr=.fl1
avrdb.menu.flmap.locksection0.build.flmapabr=.fl0

##########################################################################
#                                                                        #
###                 ###  #     # ####      ####  ####                  ###
#####              #   # #     # #   #     #   # #   #               #####
#######            #####  #   #  ####  ### #   # #   #             #######
#####              #   #   # #   # #       #   # #   #               #####
###                #   #    #    #  #      ####  ####                  ###
#________________________________________________________________________#
#                                        #
# Parameters and defaults for DD parts   #
#________________________________________#
avrdd.upload.tool=avrdude
avrdd.upload.prog_interlock=
avrdd.build.board=avrdd
avrdd.build.mvioenable=-DMVIO_ENABLED
avrdd.build.core=dxcore
avrdd.upload.maximum_size=0
avrdd.upload.maximum_data_size=0
# The maximum size and data size attributes are overridden by the selected chip. If you are avoiding specifying that somehow, there is no hope of anything working, so don't do that.
# Each top-level entry supports at least a dozen parts with varying memory constraints.
avrdd.build.f_cpu={build.speed}000000L
avrdd.build.text_section_start=.text=0x0
avrdd.build.defaultswaps=
avrdd.build.extra_flags= {bootloader.appspm} {build.mvioenable} {build.defaultswaps}
avrdd.build.export_merged_output=false
avrdd.build.highestcb=B2
avrdd.build.printf=
avrdd.build.flmapopts=
avrdd.build.attachmode=-DCORE_ATTACH_ALL

#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrdd.bootloader.tool=avrdude
avrdd.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
avrdd.bootloader.wdtwindowbits=0000
avrdd.bootloader.wdttimeotbits=0000
avrdd.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrdd.bootloader.SYSCFG0=0b110{bootloader.resetpinbits}00{bootloader.eesavebit}
avrdd.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
avrdd.bootloader.CODESIZE=0x00
avrdd.bootloader.BOOTSIZE=0x01
avrdd.bootloader.avrdudestring=
avrdd.bootloader.pymcuprogstring=-aerase

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
avrdd.build.mcupostfix=
avrdd.build.printfabr=
avrdd.build.flmapabr=.ful
avrdd.build.attachabr=
avrdd.build.wireabr=
avrdd.build.appspmabr=.spm{bootloader.CODESIZE}

