TheEccentricGenius/PRODUINO-INK-4u-Software/boards.txt
#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avrdd.menu.WDTtimeout.disabled=Disabled (recommended)
avrdd.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avrdd.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avrdd.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avrdd.menu.WDTtimeout.1second=Window remains open for 1 Second
avrdd.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avrdd.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avrdd.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avrdd.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avrdd.menu.WDTwindow.disabled=No delay before window "opens"
avrdd.menu.WDTwindow.8seconds=8 Second before window "opens"
avrdd.menu.WDTwindow.4seconds=4 Second before window "opens"
avrdd.menu.WDTwindow.2seconds=2 Second before window "opens"
avrdd.menu.WDTwindow.1second=1 Second before window "opens"
avrdd.menu.WDTwindow.500msec=500 millisecond before window "opens"
avrdd.menu.WDTwindow.250msec=250 millisecond before window "opens"
avrdd.menu.WDTwindow.125msec=125 millisecond before window "opens"
avrdd.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avrdd.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avrdd.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avrdd.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avrdd.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avrdd.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avrdd.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avrdd.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avrdd.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avrdd.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avrdd.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avrdd.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avrdd.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avrdd.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avrdd.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avrdd.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avrdd.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avrdd.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avrdd.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

#----------------------------------------#
# Flash Mapping options                  #
#________________________________________#
avrdd.menu.flmap.lockdefault=Use last FLMAP section, lock FLMAP, provide PROGMEM_MAPPED
avrdd.menu.flmap.unlocked=Start w/default, do not lock flmap. No PROGMEM_MAPPED.
avrdd.menu.flmap.locksection0=Set FLMAP to section 0, lock FLMAP, provide PROGMEM_MAPPED
avrdd.menu.flmap.lockdefault.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION1
avrdd.menu.flmap.unlocked.build.flmapopts=
avrdd.menu.flmap.locksection0.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION0
avrdd.menu.flmap.lockdefault.build.flmapabr=.fld
avrdd.menu.flmap.unlocked.build.flmapabr=.ful
avrdd.menu.flmap.locksection0.build.flmapabr=.fl0


##########################################################################
#                                                                        #
###                 ###  #     # ####      #####   ###                 ###
#####              #   # #     # #   #     #      #   #              #####
#######            #####  #   #  ####  ### ####   #####            #######
#####              #   #   # #   # #       #      #   #              #####
###                #   #    #    #  #      #####  #   #                ###
#________________________________________________________________________#
#                                        #
# Parameters and defaults for EA parts   #
#________________________________________#
avrea.upload.tool=avrdude
avrea.upload.prog_interlock=
avrea.build.board=avrea
avrea.build.core=dxcore
avrea.upload.maximum_size=0
avrea.upload.maximum_data_size=0
# The maximum size and data size attributes are overridden by the selected chip. If you are avoiding specifying that somehow, there is no hope of anything working, so don't do that.
# Each top-level entry supports at least a dozen parts with varying memory constraints.
avrea.build.f_cpu={build.speed}000000L
avrea.build.text_section_start=.text=0x0
avrea.build.extra_flags=
avrea.build.export_merged_output=false
avrea.build.printf=
avrea.build.flmapopts=

#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrea.bootloader.tool=avrdude
avrea.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
avrea.bootloader.wdtwindowbits=0000
avrea.bootloader.wdttimeotbits=0000
avrea.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrea.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrea.bootloader.CODESIZE=0x00
avrea.bootloader.BOOTSIZE=0x01
avrea.bootloader.avrdudestring=
avrea.bootloader.pymcuprogstring=-aerase

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
avrea.build.mcupostfix=
avrea.build.printfabr=
avrea.build.flmapabr=.ful
avrea.build.attachabr=
avrea.build.wireabr=
##Not supported but still need empty string here.
avrdd.build.appspmabr=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-EA submenu options                     #
#____________________________________________#
# Chip (memory and pincount)            #
#_______________________________________#
avrea.menu.chip.avr64ea28=AVR64EA28
avrea.menu.chip.avr64ea28.build.mcu=avr64ea28
avrea.menu.chip.avr64ea28.upload.maximum_size=65536
avrea.menu.chip.avr64ea28.upload.maximum_data_size=8192
avrea.menu.chip.avr64ea28.build.variant=28pin-easeries
avrea.menu.chip.avr64ea32=AVR64EA32
avrea.menu.chip.avr64ea32.build.mcu=avr64ea32
avrea.menu.chip.avr64ea32.upload.maximum_size=65536
avrea.menu.chip.avr64ea32.upload.maximum_data_size=8192
avrea.menu.chip.avr64ea32.build.variant=32pin-easeries
avrea.menu.chip.avr64ea48=AVR64EA48
avrea.menu.chip.avr64ea48.build.mcu=avr64ea48
avrea.menu.chip.avr64ea48.upload.maximum_size=65536
avrea.menu.chip.avr64ea48.upload.maximum_data_size=8192
avrea.menu.chip.avr64ea48.build.variant=48pin-easeries
avrea.menu.chip.avr32ea28=AVR32EA28
avrea.menu.chip.avr32ea28.build.mcu=avr32ea28
avrea.menu.chip.avr32ea28.upload.maximum_size=32768
avrea.menu.chip.avr32ea28.upload.maximum_data_size=4096
avrea.menu.chip.avr32ea28.build.variant=28pin-easeries
avrea.menu.chip.avr32ea32=AVR32EA32
avrea.menu.chip.avr32ea32.build.mcu=avr32ea32
avrea.menu.chip.avr32ea32.upload.maximum_size=32768
avrea.menu.chip.avr32ea32.upload.maximum_data_size=4096
avrea.menu.chip.avr32ea32.build.variant=32pin-easeries
avrea.menu.chip.avr32ea48=AVR32EA48
avrea.menu.chip.avr32ea48.build.mcu=avr32ea48
avrea.menu.chip.avr32ea48.upload.maximum_size=32768
avrea.menu.chip.avr32ea48.upload.maximum_data_size=4096
avrea.menu.chip.avr32ea48.build.variant=48pin-easeries
avrea.menu.chip.avr16ea28=AVR16EA28
avrea.menu.chip.avr16ea28.build.mcu=avr16ea28
avrea.menu.chip.avr16ea28.upload.maximum_size=16384
avrea.menu.chip.avr16ea28.upload.maximum_data_size=2048
avrea.menu.chip.avr16ea28.build.variant=28pin-easeries
avrea.menu.chip.avr16ea32=AVR16EA32
avrea.menu.chip.avr16ea32.build.mcu=avr16ea32
avrea.menu.chip.avr16ea32.upload.maximum_size=16384
avrea.menu.chip.avr16ea32.upload.maximum_data_size=2048
avrea.menu.chip.avr16ea32.build.variant=32pin-easeries
avrea.menu.chip.avr16ea48=AVR16EA48
avrea.menu.chip.avr16ea48.build.mcu=avr16ea48
avrea.menu.chip.avr16ea48.upload.maximum_size=16384
avrea.menu.chip.avr16ea48.upload.maximum_data_size=2048
avrea.menu.chip.avr16ea48.build.variant=48pin-easeries
#avrea.menu.chip.avr8ea28=AVR8EA28
#avrea.menu.chip.avr8ea28.build.mcu=avr8ea28
#avrea.menu.chip.avr8ea28.upload.maximum_size=8192
#avrea.menu.chip.avr8ea28.upload.maximum_data_size=1024
#avrea.menu.chip.avr8ea28.build.variant=28pin-easeries
#avrea.menu.chip.avr8ea32=AVR8EA32
#avrea.menu.chip.avr8ea32.build.mcu=avr8ea32
#avrea.menu.chip.avr8ea32.upload.maximum_size=8192
#avrea.menu.chip.avr8ea32.upload.maximum_data_size=1024
#avrea.menu.chip.avr8ea32.build.variant=32pin-easeries

