TheEccentricGenius/PRODUINO-INK-4u-Software/boards.txt
#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
# THIS CLOCK SETUP SUCK ASS!!       #
# Worst parts of Dx and tinyAVR!    #
#___________________________________#
avrea.menu.clock.20internal=20 MHz internal
avrea.menu.clock.20internal.build.speed=20
avrea.menu.clock.20internal.build.clocksource=0
avrea.menu.clock.16internal=16 MHz internal
avrea.menu.clock.16internal.build.speed=16
avrea.menu.clock.16internal.build.clocksource=0
avrea.menu.clock.10internal=10 MHz internal
avrea.menu.clock.10internal.build.speed=10
avrea.menu.clock.10internal.build.clocksource=0
avrea.menu.clock.8internal=8 MHz internal
avrea.menu.clock.8internal.build.speed=8
avrea.menu.clock.8internal.build.clocksource=0
avrea.menu.clock.5internal=5 MHz internal
avrea.menu.clock.5internal.build.speed=5
avrea.menu.clock.5internal.build.clocksource=0
avrea.menu.clock.4internal=4 MHz internal
avrea.menu.clock.4internal.build.speed=4
avrea.menu.clock.4internal.build.clocksource=0
avrea.menu.clock.1internal=1 MHz internal
avrea.menu.clock.1internal.build.speed=1
avrea.menu.clock.1internal.build.clocksource=0
avrea.menu.clock.20crystal=20 MHz crystal
avrea.menu.clock.20crystal.build.speed=20
avrea.menu.clock.20crystal.build.clocksource=1
avrea.menu.clock.16crystal=16 MHz crystal
avrea.menu.clock.16crystal.build.speed=16
avrea.menu.clock.16crystal.build.clocksource=1
avrea.menu.clock.12crystal=12 MHz crystal
avrea.menu.clock.12crystal.build.speed=12
avrea.menu.clock.12crystal.build.clocksource=1
avrea.menu.clock.8crystal=8 MHz crystal
avrea.menu.clock.8crystal.build.speed=8
avrea.menu.clock.8crystal.build.clocksource=1
avrea.menu.clock.20extclock=20 MHz ext. clock
avrea.menu.clock.20extclock.build.speed=20
avrea.menu.clock.20extclock.build.clocksource=2
avrea.menu.clock.16extclock=16 MHz ext. clock
avrea.menu.clock.16extclock.build.speed=16
avrea.menu.clock.16extclock.build.clocksource=2
avrea.menu.clock.12extclock=12 MHz ext. clock
avrea.menu.clock.12extclock.build.speed=12
avrea.menu.clock.12extclock.build.clocksource=2
avrea.menu.clock.8extclock=8 MHz ext. clock
avrea.menu.clock.8extclock.build.speed=8
avrea.menu.clock.8extclock.build.clocksource=2
avrea.menu.clock.24crystal=24 MHz crystal (overclocked)
avrea.menu.clock.24crystal.build.speed=24
avrea.menu.clock.24crystal.build.clocksource=1
avrea.menu.clock.25crystal=25 MHz crystal (overclocked)
avrea.menu.clock.25crystal.build.speed=25
avrea.menu.clock.25crystal.build.clocksource=1
avrea.menu.clock.27crystal=27 MHz crystal (overclocked)
avrea.menu.clock.27crystal.build.speed=27
avrea.menu.clock.27crystal.build.clocksource=1
avrea.menu.clock.28crystal=28 MHz crystal (overclocked)
avrea.menu.clock.28crystal.build.speed=28
avrea.menu.clock.28crystal.build.clocksource=1
avrea.menu.clock.30crystal=30 MHz crystal (way overclocked)
avrea.menu.clock.30crystal.build.speed=30
avrea.menu.clock.30crystal.build.clocksource=1
avrea.menu.clock.32crystal=32 MHz crystal (way overclocked)
avrea.menu.clock.32crystal.build.speed=32
avrea.menu.clock.32crystal.build.clocksource=1
#avrea.menu.clock.36crystal=36 MHz crystal (unlikely-to-work overclocked)
#avrea.menu.clock.36crystal.build.speed=36
#avrea.menu.clock.36crystal.build.clocksource=1
#avrea.menu.clock.40crystal=40 MHz crystal (unlikely-to-work overclocked)
#avrea.menu.clock.40crystal.build.speed=40
#avrea.menu.clock.40crystal.build.clocksource=1
avrea.menu.clock.24extclock=24 MHz ext. clock (overclocked)
avrea.menu.clock.24extclock.build.speed=24
avrea.menu.clock.24extclock.build.clocksource=2
avrea.menu.clock.25extclock=25 MHz ext. clock (overclocked)
avrea.menu.clock.25extclock.build.speed=25
avrea.menu.clock.25extclock.build.clocksource=2
avrea.menu.clock.27extclock=27 MHz ext. clock (overclocked)
avrea.menu.clock.27extclock.build.speed=27
avrea.menu.clock.27extclock.build.clocksource=2
avrea.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrea.menu.clock.28extclock.build.speed=28
avrea.menu.clock.28extclock.build.clocksource=2
avrea.menu.clock.30extclock=30 MHz ext. clock (wayoverclocked)
avrea.menu.clock.30extclock.build.speed=30
avrea.menu.clock.30extclock.build.clocksource=2
avrea.menu.clock.32extclock=32 MHz ext. clock (way overclocked)
avrea.menu.clock.32extclock.build.speed=32
avrea.menu.clock.32extclock.build.clocksource=2
#avrea.menu.clock.36extclock=36 MHz ext. clock (unlikely-to-work overclocked)
#avrea.menu.clock.36extclock.build.speed=36
#avrea.menu.clock.36extclock.build.clocksource=2
#avrea.menu.clock.40extclock=40 MHz ext. clock (unlikely-to-work overclocked)
#avrea.menu.clock.40extclock.build.speed=40
#avrea.menu.clock.40extclock.build.clocksource=2

#----------------------------------------#
# BrownOut detection (BOD) option        #
#________________________________________#
#    Completely speculative         #
#   Assumes same as Dx-series       #
#___________________________________#
avrea.menu.bodvoltage.1v75=1.75V (during programming only)
avrea.menu.bodvoltage.1v75.bootloader.bodlevbits=000
avrea.menu.bodvoltage.1v9=1.9V
avrea.menu.bodvoltage.1v9.bootloader.bodlevbits=001
avrea.menu.bodvoltage.2v6=2.60V
avrea.menu.bodvoltage.2v6.bootloader.bodlevbits=010
avrea.menu.bodvoltage.4v3=4.3V
avrea.menu.bodvoltage.4v3.bootloader.bodlevbits=011
avrea.menu.bodvoltage.rsvd1=Mystery1
avrea.menu.bodvoltage.rsvd1.bootloader.bodlevbits=100
avrea.menu.bodvoltage.rsvd2=Mystery2
avrea.menu.bodvoltage.rsvd2.bootloader.bodlevbits=101
avrea.menu.bodvoltage.rsvd3=Mystery3
avrea.menu.bodvoltage.rsvd3.bootloader.bodlevbits=110
avrea.menu.bodvoltage.rsvd4=Mystery4
avrea.menu.bodvoltage.rsvd4.bootloader.bodlevbits=111
avrea.menu.bodmode.disabled=Disabled/Disabled
avrea.menu.bodmode.enabled=Enabled/Enabled
avrea.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avrea.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avrea.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avrea.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avrea.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avrea.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avrea.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrea.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrea.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrea.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrea.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrea.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrea.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrea.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrea.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrea.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

