TheEccentricGenius/PRODUINO-INK-4u-Software/boards.txt
#----------------------------------------#
# Retain EEPROM (EESAVE)                 #
#________________________________________#
avrea.menu.eesave.enable=EEPROM retained
avrea.menu.eesave.enable.bootloader.eesavebit=1
avrea.menu.eesave.disable=EEPROM not retained
avrea.menu.eesave.disable.bootloader.eesavebit=0

#----------------------------------------#
# Reset pin as INPUT, UPDI as I/O        #
#________________________________________#
avrea.menu.resetupdipins.resetupdi=PF6: Reset & PF7: UPDI
avrea.menu.resetupdipins.resetupdi.bootloader.resetpinbits=11
avrea.menu.resetupdipins.inputupdi=PF6: Input & PF7: UPDI (no challenges)
avrea.menu.resetupdipins.inputupdi.bootloader.resetpinbits=10
avrea.menu.resetupdipins.resetgpio=PF6: Reset & PF7: GPIO (Danger! HV required)
avrea.menu.resetupdipins.resetgpio.bootloader.resetpinbits=01
avrea.menu.resetupdipins.inputgpio=PF6: Input & PF7: GPIO (Danger! HV required)
avrea.menu.resetupdipins.inputgpio.bootloader.resetpinbits=00

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avrea.menu.millis.tcb2=TCB2 (recommended)
avrea.menu.millis.disabled=Disabled
avrea.menu.millis.tcb0=TCB0
avrea.menu.millis.tcb1=TCB1
avrea.menu.millis.tcb3=TCB3
avrea.menu.millis.tca0=TCA0
avrea.menu.millis.tca1=TCA1
#avrea.menu.millis.rtc=RTC (no micros)
#avrea.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. xtal, no micros
#avrea.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. osc no micros
avrea.menu.millis.tcb0.build.millistimer=B0
avrea.menu.millis.tcb1.build.millistimer=B1
avrea.menu.millis.tcb2.build.millistimer=B2
avrea.menu.millis.tcb3.build.millistimer=B3
avrea.menu.millis.tca0.build.millistimer=A0
avrea.menu.millis.tca1.build.millistimer=A1
#avrea.menu.millis.rtc.build.millistimer=RTC
#avrea.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
#avrea.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
avrea.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
avrea.menu.printf.default=Default, 1.5k flash, no floats
avrea.menu.printf.full=Full, 2.6k, prints floats
avrea.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrea.menu.printf.full.build.printfabr=.pfF
avrea.menu.printf.minimal=Minimal, 1.1k flash used
avrea.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrea.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#avrea.menu.optimization.size=-Os (size)
#avrea.menu.optimization.sizegcse=-Os (size, no GCSE)
#avrea.menu.optimization.o3=-O3 (speed)
#avrea.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#avrea.menu.optimization.size.build.optimizationlevel=-Os
#avrea.menu.optimization.sizegcse.build.optimizationlevel=-Os
#avrea.menu.optimization.o3.build.optimizationlevel=-O3
#avrea.menu.optimization.o3gcse.build.optimizationlevel=-O3
#avrea.menu.optimization.size.build.optabr=.Os
#avrea.menu.optimization.sizegcse.build.optabr=.Osng
#avrea.menu.optimization.o3.build.optabr=.O3
#avrea.menu.optimization.o3gcse.build.optabr=.O3ng
#avrea.menu.optimization.sizegcse.build.gcse=-fno-gcse
#avrea.menu.optimization.o3gcse.build.gcse=-fno-gcse


#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
avrea.menu.attach.allenabled=On all pins, with new implementation.
avrea.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrea.menu.attach.manual=Only enabled ports. Please see documentation.
avrea.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrea.menu.attach.oldversion=Old version, may fix bugs.
avrea.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
avrea.menu.attach.manual.build.attachabr=.aMan
avrea.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# Startup time options                   #
#________________________________________#
#                                    #
#  Speculative but likely            #
#____________________________________#
avrea.menu.startuptime.8=8ms
avrea.menu.startuptime.1=0ms
avrea.menu.startuptime.1=1ms
avrea.menu.startuptime.2=2ms
avrea.menu.startuptime.4=4ms
avrea.menu.startuptime.16=16ms
avrea.menu.startuptime.32=32ms
avrea.menu.startuptime.64=64ms
avrea.menu.startuptime.0.bootloader.SYSCFG1=0x00
avrea.menu.startuptime.1.bootloader.SYSCFG1=0x01
avrea.menu.startuptime.2.bootloader.SYSCFG1=0x02
avrea.menu.startuptime.4.bootloader.SYSCFG1=0x03
avrea.menu.startuptime.8.bootloader.SYSCFG1=0x04
avrea.menu.startuptime.16.bootloader.SYSCFG1=0x05
avrea.menu.startuptime.32.bootloader.SYSCFG1=0x06
avrea.menu.startuptime.64.bootloader.SYSCFG1=0x07

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
avrea.menu.wiremode.mors=1x Wire, Master or Slave
avrea.menu.wiremode.mors.build.wiremode=MORS_SINGLE
avrea.menu.wiremode.mors.build.wireabr=.wO
avrea.menu.wiremode.mands=1x Wire, Master and Slave
avrea.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
avrea.menu.wiremode.mands.build.wireabr=.wA

#-------------------------------------#
# SPM from app incompatible with Dx   #
# version of flash write in major way #
#_____________________________________#


#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avrea.menu.WDTtimeout.disabled=Disabled (recommended)
avrea.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avrea.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avrea.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avrea.menu.WDTtimeout.1second=Window remains open for 1 Second
avrea.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avrea.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avrea.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avrea.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avrea.menu.WDTwindow.disabled=No delay before window "opens"
avrea.menu.WDTwindow.8seconds=8 Second before window "opens"
avrea.menu.WDTwindow.4seconds=4 Second before window "opens"
avrea.menu.WDTwindow.2seconds=2 Second before window "opens"
avrea.menu.WDTwindow.1second=1 Second before window "opens"
avrea.menu.WDTwindow.500msec=500 millisecond before window "opens"
avrea.menu.WDTwindow.250msec=250 millisecond before window "opens"
avrea.menu.WDTwindow.125msec=125 millisecond before window "opens"
avrea.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avrea.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avrea.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avrea.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avrea.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avrea.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avrea.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avrea.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avrea.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avrea.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avrea.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avrea.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avrea.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avrea.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avrea.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avrea.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avrea.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avrea.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avrea.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

