TheEccentricGenius/PRODUINO-INK-4u-Software/boards.txt
#----------------------------------------#
# Flash Mapping options                  #
#________________________________________#
avrea.menu.flmap.lockdefault=Use last FLMAP section, lock FLMAP, provide PROGMEM_MAPPED
avrea.menu.flmap.unlocked=Start w/default, do not lock flmap. No PROGMEM_MAPPED.
avrea.menu.flmap.locksection0=Set FLMAP to section 0, lock FLMAP, provide PROGMEM_MAPPED
avrea.menu.flmap.lockdefault.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION1
avrea.menu.flmap.unlocked.build.flmapopts=
avrea.menu.flmap.locksection0.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION0
avrea.menu.flmap.lockdefault.build.flmapabr=.fld
avrea.menu.flmap.unlocked.build.flmapabr=.ful
avrea.menu.flmap.locksection0.build.flmapabr=.fl0

##########################################################################
#                                                                        #
#   ###  #     # ####      ####   ###            ###          #          #
#  #   # #     # #   #     #   # #   #          #   #        ###  ##     #
#  #####  #   #  ####  ### #   # #####          #   #  ###    #          #
#  #   #   # #   # #       #   # #   #          #   #  #  #   #   ##     #
#  #   #    #    #  #      ####  #   #           ###   ###    #   ##     #
#______________________________________________________#_________________#
#                                        #             #
# Parameters and defaults for DA parts   #
#________________________________________#
avrdaopti.build.board=avrda
avrdaopti.build.core=dxcore
avrdaopti.upload.maximum_size=0
avrdaopti.upload.maximum_data_size=0
# The maximum size and data size attributes are overridden by the selected chip. If you are avoiding specifying that somehow, there is no hope of anything working, so don't do that.
# Each top-level entry supports at least a dozen parts with varying memory constraints.
avrdaopti.build.f_cpu={build.speed}000000L
avrdaopti.build.text_section_start=.text=0x200
avrdaopti.build.extra_flags= -DSERIAL_PORT_BOOT={bootloader.portname} -DSERIAL_PORT_BOOT_PORTMUX={bootloader.portswap} -DUSING_OPTIBOOT
avrdaopti.build.export_merged_output=true
avrdaopti.build.printf=
avrdaopti.build.flmapopts=
avrdaopti.build.attachmode=-DCORE_ATTACH_ALL

#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrdaopti.bootloader.tool=avrdude
avrdaopti.bootloader.defaultentrycond=_extrf
avrdaopti.bootloader.entrycond={bootloader.defaultentrycond}
avrdaopti.bootloader.file={runtime.platform.path}/bootloaders/hex/{bootloader.class}{bootloader.port}{bootloader.entrycond}.hex
avrdaopti.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
avrdaopti.bootloader.wdtwindowbits=0000
avrdaopti.bootloader.wdttimeotbits=0000
avrdaopti.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrdaopti.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
avrdaopti.bootloader.CODESIZE=0x00
avrdaopti.bootloader.BOOTSIZE=0x01
avrdaopti.bootloader.avrdudestring=-Uflash:w:{bootloader.file}:i
avrdaopti.bootloader.pymcuprogstring=-f "{bootloader.file}" -a write

#----------------------------------------#
# Upload parameters for Optiboot         #
#________________________________________#
avrdaopti.upload.tool=avrdude
avrdaopti.upload.protocol=arduino
avrdaopti.upload.extra_params=-D
avrdaopti.upload.speed=115200
avrdaopti.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
avrdaopti.build.mcupostfix=opti
avrdaopti.build.printfabr=
avrdaopti.build.flmapabr=.ful
avrdaopti.build.attachabr=
avrdaopti.build.wireabr=
avrdaopti.build.appspmabr=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DA (Optiboot) submenu options          #
#____________________________________________#
#                                        #
# Chip (memory and pincount)             #
#________________________________________#
avrdaopti.menu.chip.avr128da28=AVR128DA28
avrdaopti.menu.chip.avr128da28.build.mcu=avr128da28
avrdaopti.menu.chip.avr128da28.upload.maximum_size=130560
avrdaopti.menu.chip.avr128da28.bootloader.class=optiboot_128dx
avrdaopti.menu.chip.avr128da28.upload.maximum_data_size=16384
avrdaopti.menu.chip.avr128da28.build.variant=28pin-standard
avrdaopti.menu.chip.avr128da32=AVR128DA32
avrdaopti.menu.chip.avr128da32.build.mcu=avr128da32
avrdaopti.menu.chip.avr128da32.upload.maximum_size=130560
avrdaopti.menu.chip.avr128da32.bootloader.class=optiboot_128dx
avrdaopti.menu.chip.avr128da32.upload.maximum_data_size=16384
avrdaopti.menu.chip.avr128da32.build.variant=32pin-standard
avrdaopti.menu.chip.avr128da48=AVR128DA48
avrdaopti.menu.chip.avr128da48.build.mcu=avr128da48
avrdaopti.menu.chip.avr128da48.upload.maximum_size=130560
avrdaopti.menu.chip.avr128da48.bootloader.class=optiboot_128dx
avrdaopti.menu.chip.avr128da48.upload.maximum_data_size=16384
avrdaopti.menu.chip.avr128da48.build.variant=48pin-standard
avrdaopti.menu.chip.avr128da64=AVR128DA64
avrdaopti.menu.chip.avr128da64.build.mcu=avr128da64
avrdaopti.menu.chip.avr128da64.upload.maximum_size=130560
avrdaopti.menu.chip.avr128da64.bootloader.class=optiboot_128dx
avrdaopti.menu.chip.avr128da64.upload.maximum_data_size=16384
avrdaopti.menu.chip.avr128da64.build.variant=64pin-standard
avrdaopti.menu.chip.avr64da28=AVR64DA28
avrdaopti.menu.chip.avr64da28.build.mcu=avr64da28
avrdaopti.menu.chip.avr64da28.upload.maximum_size=65024
avrdaopti.menu.chip.avr64da28.bootloader.class=optiboot_64dx
avrdaopti.menu.chip.avr64da28.upload.maximum_data_size=8192
avrdaopti.menu.chip.avr64da28.build.variant=28pin-standard
avrdaopti.menu.chip.avr64da32=AVR64DA32
avrdaopti.menu.chip.avr64da32.build.mcu=avr64da32
avrdaopti.menu.chip.avr64da32.upload.maximum_size=65024
avrdaopti.menu.chip.avr64da32.bootloader.class=optiboot_64dx
avrdaopti.menu.chip.avr64da32.upload.maximum_data_size=8192
avrdaopti.menu.chip.avr64da32.build.variant=32pin-standard
avrdaopti.menu.chip.avr64da48=AVR64DA48
avrdaopti.menu.chip.avr64da48.build.mcu=avr64da48
avrdaopti.menu.chip.avr64da48.upload.maximum_size=65024
avrdaopti.menu.chip.avr64da48.bootloader.class=optiboot_64dx
avrdaopti.menu.chip.avr64da48.upload.maximum_data_size=8192
avrdaopti.menu.chip.avr64da48.build.variant=48pin-standard
avrdaopti.menu.chip.avr64da64=AVR64DA64
avrdaopti.menu.chip.avr64da64.build.mcu=avr64da64
avrdaopti.menu.chip.avr64da64.upload.maximum_size=65024
avrdaopti.menu.chip.avr64da64.bootloader.class=optiboot_64dx
avrdaopti.menu.chip.avr64da64.upload.maximum_data_size=8192
avrdaopti.menu.chip.avr64da64.build.variant=64pin-standard
avrdaopti.menu.chip.avr32da28=AVR32DA28
avrdaopti.menu.chip.avr32da28.build.mcu=avr32da28
avrdaopti.menu.chip.avr32da28.upload.maximum_size=32256
avrdaopti.menu.chip.avr32da28.bootloader.class=optiboot_32dx
avrdaopti.menu.chip.avr32da28.upload.maximum_data_size=4096
avrdaopti.menu.chip.avr32da28.build.variant=28pin-standard
avrdaopti.menu.chip.avr32da32=AVR32DA32
avrdaopti.menu.chip.avr32da32.build.mcu=avr32da32
avrdaopti.menu.chip.avr32da32.upload.maximum_size=32256
avrdaopti.menu.chip.avr32da32.bootloader.class=optiboot_32dx
avrdaopti.menu.chip.avr32da32.upload.maximum_data_size=4096
avrdaopti.menu.chip.avr32da32.build.variant=32pin-standard
avrdaopti.menu.chip.avr32da48=AVR32DA48
avrdaopti.menu.chip.avr32da48.build.mcu=avr32da48
avrdaopti.menu.chip.avr32da48.upload.maximum_size=32256
avrdaopti.menu.chip.avr32da48.bootloader.class=optiboot_32dx
avrdaopti.menu.chip.avr32da48.upload.maximum_data_size=4096
avrdaopti.menu.chip.avr32da48.build.variant=48pin-standard

