TheEccentricGenius/PRODUINO-INK-4u-Software/boards.txt
#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
avrdaopti.menu.clock.24internal=24 MHz internal
avrdaopti.menu.clock.24internal.build.speed=24
avrdaopti.menu.clock.24internal.build.clocksource=0
avrdaopti.menu.clock.20internal=20 MHz internal
avrdaopti.menu.clock.20internal.build.speed=20
avrdaopti.menu.clock.20internal.build.clocksource=0
avrdaopti.menu.clock.16internal=16 MHz internal
avrdaopti.menu.clock.16internal.build.speed=16
avrdaopti.menu.clock.16internal.build.clocksource=0
avrdaopti.menu.clock.12internal=12 MHz internal
avrdaopti.menu.clock.12internal.build.speed=12
avrdaopti.menu.clock.12internal.build.clocksource=0
avrdaopti.menu.clock.10internal=10 MHz internal
avrdaopti.menu.clock.10internal.build.speed=10
avrdaopti.menu.clock.10internal.build.clocksource=0
avrdaopti.menu.clock.8internal=8 MHz internal
avrdaopti.menu.clock.8internal.build.speed=8
avrdaopti.menu.clock.8internal.build.clocksource=0
avrdaopti.menu.clock.5internal=5 MHz internal
avrdaopti.menu.clock.5internal.build.speed=5
avrdaopti.menu.clock.5internal.build.clocksource=0
avrdaopti.menu.clock.4internal=4 MHz internal
avrdaopti.menu.clock.4internal.build.speed=4
avrdaopti.menu.clock.4internal.build.clocksource=0
avrdaopti.menu.clock.1internal=1 MHz internal
avrdaopti.menu.clock.1internal.build.speed=1
avrdaopti.menu.clock.1internal.build.clocksource=0
avrdaopti.menu.clock.24extclock=24 MHz ext. clock
avrdaopti.menu.clock.24extclock.build.speed=24
avrdaopti.menu.clock.24extclock.build.clocksource=2
avrdaopti.menu.clock.20extclock=20 MHz ext. clock
avrdaopti.menu.clock.20extclock.build.speed=20
avrdaopti.menu.clock.20extclock.build.clocksource=2
avrdaopti.menu.clock.16extclock=16 MHz ext. clock
avrdaopti.menu.clock.16extclock.build.speed=16
avrdaopti.menu.clock.16extclock.build.clocksource=2
avrdaopti.menu.clock.12extclock=12 MHz ext. clock
avrdaopti.menu.clock.12extclock.build.speed=12
avrdaopti.menu.clock.12extclock.build.clocksource=2
avrdaopti.menu.clock.8extclock=8 MHz ext. clock
avrdaopti.menu.clock.8extclock.build.speed=8
avrdaopti.menu.clock.8extclock.build.clocksource=2
avrdaopti.menu.clock.28internal=28 MHz internal (overclocked)
avrdaopti.menu.clock.28internal.build.speed=28
avrdaopti.menu.clock.28internal.build.clocksource=0
avrdaopti.menu.clock.32internal=32 MHz internal (overclocked)
avrdaopti.menu.clock.32internal.build.speed=32
avrdaopti.menu.clock.32internal.build.clocksource=0
avrdaopti.menu.clock.25extclock=25 MHz ext. clock (slightly overclocked)
avrdaopti.menu.clock.25extclock.build.speed=25
avrdaopti.menu.clock.25extclock.build.clocksource=2
avrdaopti.menu.clock.27extclock=27 MHz ext. clock (overclocked)
avrdaopti.menu.clock.27extclock.build.speed=27
avrdaopti.menu.clock.27extclock.build.clocksource=2
avrdaopti.menu.clock.28extclock=28 MHz ext. clock (overclocked)
avrdaopti.menu.clock.28extclock.build.speed=28
avrdaopti.menu.clock.28extclock.build.clocksource=2
avrdaopti.menu.clock.30extclock=30 MHz ext. clock (overclocked)
avrdaopti.menu.clock.30extclock.build.speed=30
avrdaopti.menu.clock.30extclock.build.clocksource=2
avrdaopti.menu.clock.32extclock=32 MHz ext. clock (overclocked)
avrdaopti.menu.clock.32extclock.build.speed=32
avrdaopti.menu.clock.32extclock.build.clocksource=2
avrdaopti.menu.clock.36extclock=36 MHz ext. clock (highly overclocked)
avrdaopti.menu.clock.36extclock.build.speed=36
avrdaopti.menu.clock.36extclock.build.clocksource=2
avrdaopti.menu.clock.40extclock=40 MHz ext. clock (highly overclocked)
avrdaopti.menu.clock.40extclock.build.speed=40
avrdaopti.menu.clock.40extclock.build.clocksource=2
avrdaopti.menu.clock.48extclock=48 MHz ext. clock (WAY overclocked)
avrdaopti.menu.clock.48extclock.build.speed=48
avrdaopti.menu.clock.48extclock.build.clocksource=2


#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
avrdaopti.menu.bodvoltage.1v9=1.9V
avrdaopti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
avrdaopti.menu.bodvoltage.2v45=2.45V
avrdaopti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
avrdaopti.menu.bodvoltage.2v70=2.70V
avrdaopti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
avrdaopti.menu.bodvoltage.2v85=2.85V
avrdaopti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
avrdaopti.menu.bodmode.disabled=Disabled/Disabled
avrdaopti.menu.bodmode.enabled=Enabled/Enabled
avrdaopti.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
avrdaopti.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
avrdaopti.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
avrdaopti.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
avrdaopti.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
avrdaopti.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
avrdaopti.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
avrdaopti.menu.bodmode.disabled.bootloader.BODCFG=0x00
avrdaopti.menu.bodmode.enabled.bootloader.bodmodebits=00101
avrdaopti.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
avrdaopti.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
avrdaopti.menu.bodmode.samplefast.bootloader.bodmodebits=01010
avrdaopti.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
avrdaopti.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
avrdaopti.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
avrdaopti.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# Reset pin as input option              #
#________________________________________#
avrdaopti.menu.resetpin.reset=PF6: Reset (default boot entry on reset pin & SW resets, 1 sec timeout)
avrdaopti.menu.resetpin.reset.bootloader.defaultentrycond=_extr
avrdaopti.menu.resetpin.reset.bootloader.resetpinbits=10
avrdaopti.menu.resetpin.input=PF6: Input (default boot entry on power on & SW resets, 8 sec timeout)
avrdaopti.menu.resetpin.input.bootloader.defaultentrycond=_por_8sec
avrdaopti.menu.resetpin.input.bootloader.resetpinbits=00

#----------------------------------------#
# Optiboot Entry Conditions              #
#________________________________________#
avrdaopti.menu.entrycond.default=Default (see documentation)
avrdaopti.menu.entrycond.extr=External (reset pin) (see documentation)
avrdaopti.menu.entrycond.extronly=External reset only (see documentation)
avrdaopti.menu.entrycond.all=Always (see documentation)
avrdaopti.menu.entrycond.poronly= Power on only (see documentation)
avrdaopti.menu.entrycond.swr=SW-only: 8 second timeout (see documentation)
avrdaopti.menu.entrycond.extr_slow=External (reset pin), slow (see documentation)
avrdaopti.menu.entrycond.default.bootloader.entrycond={bootloader.defaultentrycond}
avrdaopti.menu.entrycond.extr.bootloader.entrycond=_extr
avrdaopti.menu.entrycond.extronly.bootloader.entrycond=_extronly
avrdaopti.menu.entrycond.poronly.bootloader.entrycond=_poronly_8sec
avrdaopti.menu.entrycond.all.bootloader.entrycond=_all_8sec
avrdaopti.menu.entrycond.swr.bootloader.entrycond=_swronly_8sec
avrdaopti.menu.entrycond.extr_slow.bootloader.entrycond=_extr_8sec

