TheEccentricGenius/PRODUINO-INK-4u-Software/boards.txt
#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
avrdaopti.menu.millis.tcb2=TCB2 (recommended)
avrdaopti.menu.millis.disabled=Disabled (delay() only)
avrdaopti.menu.millis.tcb0=TCB0
avrdaopti.menu.millis.tcb1=TCB1
avrdaopti.menu.millis.tcb3=TCB3 (48/64-pin parts only)
avrdaopti.menu.millis.tcb4=TCB4 (64-pin parts only)
avrdaopti.menu.millis.tca0=TCA0
avrdaopti.menu.millis.tca1=TCA1 (48/64-pin parts only)
avrdaopti.menu.millis.tcb0.build.millistimer=B0
avrdaopti.menu.millis.tcb1.build.millistimer=B1
avrdaopti.menu.millis.tcb2.build.millistimer=B2
avrdaopti.menu.millis.tcb3.build.millistimer=B3
avrdaopti.menu.millis.tcb4.build.millistimer=B4
avrdaopti.menu.millis.tca0.build.millistimer=A0
avrdaopti.menu.millis.tca1.build.millistimer=A1
avrdaopti.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
avrdaopti.menu.printf.default=Default, 1.5k flash, no floats
avrdaopti.menu.printf.full=Full, 2.6k, prints floats
avrdaopti.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
avrdaopti.menu.printf.full.build.printfabr=.pfF
avrdaopti.menu.printf.minimal=Minimal, 1.1k flash used
avrdaopti.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
avrdaopti.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#avrdaopti.menu.optimization.size=-Os (size)
#avrdaopti.menu.optimization.sizegcse=-Os (size, no GCSE)
#avrdaopti.menu.optimization.o3=-O3 (speed)
#avrdaopti.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#avrdaopti.menu.optimization.size.build.optimizationlevel=-Os
#avrdaopti.menu.optimization.sizegcse.build.optimizationlevel=-Os
#avrdaopti.menu.optimization.o3.build.optimizationlevel=-O3
#avrdaopti.menu.optimization.o3gcse.build.optimizationlevel=-O3
#avrdaopti.menu.optimization.size.build.optabr=.Os
#avrdaopti.menu.optimization.sizegcse.build.optabr=.Osng
#avrdaopti.menu.optimization.o3.build.optabr=.O3
#avrdaopti.menu.optimization.o3gcse.build.optabr=.O3ng
#avrdaopti.menu.optimization.sizegcse.build.gcse=-fno-gcse
#avrdaopti.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
avrdaopti.menu.attach.allenabled=On all pins, with new implementation.
avrdaopti.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
avrdaopti.menu.attach.manual=Only enabled ports. Please see documentation.
avrdaopti.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
avrdaopti.menu.attach.oldversion=Old version, (may fix bugs)
avrdaopti.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
avrdaopti.menu.attach.manual.build.attachabr=.aMan
avrdaopti.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# Startup time options                   #
#________________________________________#
avrdaopti.menu.startuptime.8=8ms
avrdaopti.menu.startuptime.1=0ms
avrdaopti.menu.startuptime.1=1ms
avrdaopti.menu.startuptime.2=2ms
avrdaopti.menu.startuptime.4=4ms
avrdaopti.menu.startuptime.16=16ms
avrdaopti.menu.startuptime.32=32ms
avrdaopti.menu.startuptime.64=64ms
avrdaopti.menu.startuptime.0.bootloader.SYSCFG1=0x00
avrdaopti.menu.startuptime.1.bootloader.SYSCFG1=0x01
avrdaopti.menu.startuptime.2.bootloader.SYSCFG1=0x02
avrdaopti.menu.startuptime.4.bootloader.SYSCFG1=0x03
avrdaopti.menu.startuptime.8.bootloader.SYSCFG1=0x04
avrdaopti.menu.startuptime.16.bootloader.SYSCFG1=0x05
avrdaopti.menu.startuptime.32.bootloader.SYSCFG1=0x06
avrdaopti.menu.startuptime.64.bootloader.SYSCFG1=0x07

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
avrdaopti.menu.wiremode.mors=1x Wire, Master or Slave (least Flash & RAM)
avrdaopti.menu.wiremode.mors.build.wiremode=MORS_SINGLE
avrdaopti.menu.wiremode.mors.build.wireabr=.wO
avrdaopti.menu.wiremode.mands=1x Wire, Master and Slave
avrdaopti.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
avrdaopti.menu.wiremode.mands.build.wireabr=.wA
avrdaopti.menu.wiremode.mors2=2x Wire, Master or Slave (>28 pin only)
avrdaopti.menu.wiremode.mors2.build.wiremode=MORS_BOTH
avrdaopti.menu.wiremode.mors2.build.wireabr=.wO2
avrdaopti.menu.wiremode.mands2=2x Wire, Master and Slave (>28 pin only)
avrdaopti.menu.wiremode.mands2.build.wiremode=MANDS_BOTH
avrdaopti.menu.wiremode.mands2.build.wireabr=.wA2

#----------------------------------------#
# Optiboot serial port                   #
#________________________________________#
avrdaopti.menu.bootloaderusart.ser0_alt=USART0 (alt): TX PA4, RX PA5
avrdaopti.menu.bootloaderusart.ser0_alt.bootloader.port=_ser0_alt
avrdaopti.menu.bootloaderusart.ser0_alt.bootloader.portname=Serial
avrdaopti.menu.bootloaderusart.ser0_alt.bootloader.portswap=1
avrdaopti.menu.bootloaderusart.ser0=USART0 (default pins): TX PA0, RX PA1 (int. clock only)
avrdaopti.menu.bootloaderusart.ser0.bootloader.port=_ser0
avrdaopti.menu.bootloaderusart.ser0.bootloader.portname=Serial
avrdaopti.menu.bootloaderusart.ser0.bootloader.portswap=0
avrdaopti.menu.bootloaderusart.ser1=USART1: TX PC0, RX PC1
avrdaopti.menu.bootloaderusart.ser1.bootloader.port=_ser1
avrdaopti.menu.bootloaderusart.ser1.bootloader.portname=Serial1
avrdaopti.menu.bootloaderusart.ser1.bootloader.portswap=0
avrdaopti.menu.bootloaderusart.ser1_alt=USART1 (alt): TX PC4, RX PC5 (48/64-pin only)
avrdaopti.menu.bootloaderusart.ser1_alt.bootloader.port=_ser1_alt
avrdaopti.menu.bootloaderusart.ser1_alt.bootloader.portname=Serial1
avrdaopti.menu.bootloaderusart.ser1_alt.bootloader.portswap=1
avrdaopti.menu.bootloaderusart.ser2=USART2: TX PF0, RX PF1
avrdaopti.menu.bootloaderusart.ser2.bootloader.port=_ser2
avrdaopti.menu.bootloaderusart.ser2.bootloader.portname=Serial2
avrdaopti.menu.bootloaderusart.ser2.bootloader.portswap=0
avrdaopti.menu.bootloaderusart.ser2_alt=USART2 (alt): TX PF4, RX PF5 (>28 pin only)
avrdaopti.menu.bootloaderusart.ser2_alt.bootloader.port=_ser2_alt
avrdaopti.menu.bootloaderusart.ser2_alt.bootloader.portname=Serial2
avrdaopti.menu.bootloaderusart.ser2_alt.bootloader.portswap=1
avrdaopti.menu.bootloaderusart.ser3=USART3: TX PB0, RX PB1 (48/64-pin only)
avrdaopti.menu.bootloaderusart.ser3.bootloader.port=_ser3
avrdaopti.menu.bootloaderusart.ser3.bootloader.portname=Serial3
avrdaopti.menu.bootloaderusart.ser3.bootloader.portswap=0
avrdaopti.menu.bootloaderusart.ser3_alt=USART3 (alt): TX PB4, RX PB5 (48/64-pin only)
avrdaopti.menu.bootloaderusart.ser3_alt.bootloader.port=_ser3_alt
avrdaopti.menu.bootloaderusart.ser3_alt.bootloader.portname=Serial3
avrdaopti.menu.bootloaderusart.ser3_alt.bootloader.portswap=1
avrdaopti.menu.bootloaderusart.ser4=USART4: TX PE0, RX PE1 (48/64-pin only)
avrdaopti.menu.bootloaderusart.ser4.bootloader.port=_ser4
avrdaopti.menu.bootloaderusart.ser4.bootloader.portname=Serial4
avrdaopti.menu.bootloaderusart.ser4.bootloader.portswap=0
avrdaopti.menu.bootloaderusart.ser4_alt=USART4 (alt): TX PE4, RX PE5 (64-pin only)
avrdaopti.menu.bootloaderusart.ser4_alt.bootloader.port=_ser4_alt
avrdaopti.menu.bootloaderusart.ser4_alt.bootloader.portname=Serial4
avrdaopti.menu.bootloaderusart.ser4_alt.bootloader.portswap=1
avrdaopti.menu.bootloaderusart.ser5=USART5: TX PG0, RX PG1 (64-pin only)
avrdaopti.menu.bootloaderusart.ser5.bootloader.port=_ser5
avrdaopti.menu.bootloaderusart.ser5.bootloader.portname=Serial5
avrdaopti.menu.bootloaderusart.ser5.bootloader.portswap=0
avrdaopti.menu.bootloaderusart.ser5_alt=USART5 (alt): TX PG4, RX PG5 (64-pin only)
avrdaopti.menu.bootloaderusart.ser5_alt.bootloader.port=_ser5_alt
avrdaopti.menu.bootloaderusart.ser5_alt.bootloader.portname=Serial5
avrdaopti.menu.bootloaderusart.ser5_alt.bootloader.portswap=1


