TheEccentricGenius/PRODUINO-INK-4u-Software/boards.txt
#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avrdaopti.menu.WDTtimeout.disabled=Disabled (recommended)
avrdaopti.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avrdaopti.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avrdaopti.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avrdaopti.menu.WDTtimeout.1second=Window remains open for 1 Second
avrdaopti.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avrdaopti.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avrdaopti.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avrdaopti.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avrdaopti.menu.WDTwindow.disabled=No delay before window "opens"
avrdaopti.menu.WDTwindow.8seconds=8 Second before window "opens"
avrdaopti.menu.WDTwindow.4seconds=4 Second before window "opens"
avrdaopti.menu.WDTwindow.2seconds=2 Second before window "opens"
avrdaopti.menu.WDTwindow.1second=1 Second before window "opens"
avrdaopti.menu.WDTwindow.500msec=500 millisecond before window "opens"
avrdaopti.menu.WDTwindow.250msec=250 millisecond before window "opens"
avrdaopti.menu.WDTwindow.125msec=125 millisecond before window "opens"
avrdaopti.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avrdaopti.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avrdaopti.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avrdaopti.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avrdaopti.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avrdaopti.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avrdaopti.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avrdaopti.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avrdaopti.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avrdaopti.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avrdaopti.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avrdaopti.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avrdaopti.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avrdaopti.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avrdaopti.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avrdaopti.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avrdaopti.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avrdaopti.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avrdaopti.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

#----------------------------------------#
# Flash Mapping options                  #
#________________________________________#
avrdaopti.menu.flmap.lockdefault=Use last FLMAP section, lock FLMAP, provide PROGMEM_MAPPED
avrdaopti.menu.flmap.unlocked=Start w/default, do not lock flmap. No PROGMEM_MAPPED.
avrdaopti.menu.flmap.locksection02=Set FLMAP to section 2, lock FLMAP, provide PROGMEM_MAPPED
avrdaopti.menu.flmap.locksection1=Set FLMAP to section 1, lock FLMAP, provide PROGMEM_MAPPED
avrdaopti.menu.flmap.locksection0=Set FLMAP to section 0, lock FLMAP, provide PROGMEM_MAPPED
avrdaopti.menu.flmap.lockdefault.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION3
avrdaopti.menu.flmap.unlocked.build.flmapopts=
avrdaopti.menu.flmap.locksection02.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION2
avrdaopti.menu.flmap.locksection1.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION1
avrdaopti.menu.flmap.locksection0.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION0
avrdaopti.menu.flmap.lockdefault.build.flmapabr=.fld
avrdaopti.menu.flmap.unlocked.build.flmapabr=.ful
avrdaopti.menu.flmap.locksection02.build.flmapabr=.fl2
avrdaopti.menu.flmap.locksection1.build.flmapabr=.fl1
avrdaopti.menu.flmap.locksection0.build.flmapabr=.fl0

##########################################################################
#                                                                        #
#   ###  #     # ####      ####  ####            ###          #          #
#  #   # #     # #   #     #   # #   #          #   #        ###  ##     #
#  #####  #   #  ####  ### #   # ####           #   #  ###    #          #
#  #   #   # #   # #       #   # #   #          #   #  #  #   #   ##     #
#  #   #    #    #  #      ####  ####            ###   ###    #   ##     #
#______________________________________________________#_________________#
#                                        #             #
# Parameters and defaults for DB parts   #
#________________________________________#
avrdbopti.build.board=avrdb
avrdbopti.build.mvioenable=-DMVIO_ENABLED
avrdbopti.build.core=dxcore
avrdbopti.upload.maximum_size=0
avrdbopti.upload.maximum_data_size=0
# The maximum size and data size attributes are overridden by the selected chip. If you are avoiding specifying that somehow, there is no hope of anything working, so don't do that.
# Each top-level entry supports at least a dozen parts with varying memory constraints.
avrdbopti.build.f_cpu={build.speed}000000L
avrdbopti.build.text_section_start=.text=0x200
avrdbopti.build.extra_flags= -DSERIAL_PORT_BOOT={bootloader.portname} -DSERIAL_PORT_BOOT_PORTMUX={bootloader.portswap} -DUSING_OPTIBOOT {build.mvioenable}
avrdbopti.build.export_merged_output=true
avrdbopti.build.printf=
avrdbopti.build.flmapopts=
avrdbopti.build.attachmode=-DCORE_ATTACH_ALL

#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrdbopti.bootloader.tool=avrdude
avrdbopti.bootloader.defaultentrycond=_extrf
avrdbopti.bootloader.entrycond={bootloader.defaultentrycond}
avrdbopti.bootloader.file={runtime.platform.path}/bootloaders/hex/{bootloader.class}{bootloader.port}{bootloader.entrycond}.hex
avrdbopti.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
avrdbopti.bootloader.wdtwindowbits=0000
avrdbopti.bootloader.wdttimeotbits=0000
avrdbopti.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrdbopti.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
avrdbopti.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
avrdbopti.bootloader.CODESIZE=0x00
avrdbopti.bootloader.BOOTSIZE=0x01
avrdbopti.bootloader.avrdudestring=-Uflash:w:{bootloader.file}:i
avrdbopti.bootloader.pymcuprogstring=-f "{bootloader.file}" -a write

