TheEccentricGenius/PRODUINO-INK-4u-Software/boards.txt
#----------------------------------------#
# Flash Mapping options                  #
#________________________________________#
avrdbopti.menu.flmap.lockdefault=Use last FLMAP section, lock FLMAP, provide PROGMEM_MAPPED
avrdbopti.menu.flmap.unlocked=Start w/default, do not lock flmap. No PROGMEM_MAPPED.
avrdbopti.menu.flmap.locksection02=Set FLMAP to section 2, lock FLMAP, provide PROGMEM_MAPPED
avrdbopti.menu.flmap.locksection1=Set FLMAP to section 1, lock FLMAP, provide PROGMEM_MAPPED
avrdbopti.menu.flmap.locksection0=Set FLMAP to section 0, lock FLMAP, provide PROGMEM_MAPPED
avrdbopti.menu.flmap.lockdefault.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION3
avrdbopti.menu.flmap.unlocked.build.flmapopts=
avrdbopti.menu.flmap.locksection02.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION2
avrdbopti.menu.flmap.locksection1.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION1
avrdbopti.menu.flmap.locksection0.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION0
avrdbopti.menu.flmap.lockdefault.build.flmapabr=.fld
avrdbopti.menu.flmap.unlocked.build.flmapabr=.ful
avrdbopti.menu.flmap.locksection02.build.flmapabr=.fl2
avrdbopti.menu.flmap.locksection1.build.flmapabr=.fl1
avrdbopti.menu.flmap.locksection0.build.flmapabr=.fl0


##########################################################################
#                                                                        #
#   ###  #     # ####      ####  ####            ###          #          #
#  #   # #     # #   #     #   # #   #          #   #        ###  ##     #
#  #####  #   #  ####  ### #   # #   #          #   #  ###    #          #
#  #   #   # #   # #       #   # #   #          #   #  #  #   #   ##     #
#  #   #    #    #  #      ####  ####            ###   ###    #   ##     #
#______________________________________________________#_________________#
#                                        #             #
# Parameters and defaults for DD parts   #
#________________________________________#
avrddopti.build.board=avrdd
avrddopti.build.mvioenable=-DMVIO_ENABLED
avrddopti.build.core=dxcore
avrddopti.upload.maximum_size=0
avrddopti.upload.maximum_data_size=0
# The maximum size and data size attributes are overridden by the selected chip. If you are avoiding specifying that somehow, there is no hope of anything working, so don't do that.
# Each top-level entry supports at least a dozen parts with varying memory constraints.
avrddopti.build.f_cpu={build.speed}000000L
avrddopti.build.text_section_start=.text=0x200
avrddopti.build.altled=
avrddopti.build.14pinled=
avrddopti.build.defaultswaps=
# Now that's an ugly hack! - both of these empty string options get overridden. On 14-pin parts 14pinled is overridden to take the value of {build.altled}.
# But that's an empty string.... UNLESS Serial1 instead of Serial0 is used, and is used with the ALT2 mux option. Then the LED couldn't be on the default pin, so we use PD4 instead of PD6.
avrddopti.build.extra_flags= -DSERIAL_PORT_BOOT={bootloader.portname} -DSERIAL_PORT_BOOT_PORTMUX={bootloader.portswap} -DUSING_OPTIBOOT {build.mvioenable} {build.altled} {build.defaultswaps}
avrddopti.build.export_merged_output=false
avrddopti.build.highestcb=B2
avrddopti.build.printf=
avrddopti.build.flmapopts=
avrddopti.build.attachmode=-DCORE_ATTACH_ALL

#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrddopti.bootloader.tool=avrdude
avrddopti.bootloader.file={runtime.platform.path}/bootloaders/hex/{bootloader.class}{bootloader.port}{bootloader.entrycond}.hex
avrddopti.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
avrddopti.bootloader.wdtwindowbits=0000
avrddopti.bootloader.wdttimeotbits=0000
avrddopti.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrddopti.bootloader.SYSCFG0=0b110{bootloader.resetpinbits}000
avrddopti.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
avrddopti.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
avrddopti.bootloader.CODESIZE=0x00
avrddopti.bootloader.BOOTSIZE=0x01
avrddopti.bootloader.avrdudestring=-Uflash:w:{bootloader.file}:i
avrddopti.bootloader.pymcuprogstring=-f "{bootloader.file}" -a write

#----------------------------------------#
# Upload parameters for Optiboot         #
#________________________________________#
avrddopti.upload.tool=avrdude
avrddopti.upload.protocol=arduino
avrddopti.upload.extra_params=-D
avrddopti.upload.speed=115200
avrddopti.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
avrddopti.build.mcupostfix=opti
avrddopti.build.printfabr=
avrddopti.build.flmapabr=.ful
avrddopti.build.attachabr=
avrddopti.build.wireabr=
avrddopti.build.appspmabr=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DD submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
# 14/20-pin parts get default millis     #
# changed just like tinyAVRs do          #
#________________________________________#
avrddopti.menu.chip.avr64dd32=AVR64DD32
avrddopti.menu.chip.avr64dd28=AVR64DD28
avrddopti.menu.chip.avr64dd20=AVR64DD20
avrddopti.menu.chip.avr64dd14=AVR64DD14 (LED: PD7 if bootloader on Serial, else PD5)
avrddopti.menu.chip.avr32dd32=AVR32DD32
avrddopti.menu.chip.avr32dd28=AVR32DD28
avrddopti.menu.chip.avr32dd20=AVR32DD20
avrddopti.menu.chip.avr32dd14=AVR32DD14 (LED: PD7 if bootloader on Serial, else PD5)
avrddopti.menu.chip.avr16dd32=AVR16DD32
avrddopti.menu.chip.avr16dd28=AVR16DD28
avrddopti.menu.chip.avr16dd20=AVR16DD20
avrddopti.menu.chip.avr16dd14=AVR16DD14 (LED: PD7 if bootloader on Serial, else PD5)
avrddopti.menu.chip.avr64dd32.build.mcu=avr64dd32
avrddopti.menu.chip.avr64dd32.bootloader.class=optiboot_64dd
avrddopti.menu.chip.avr64dd32.upload.maximum_size=65024
avrddopti.menu.chip.avr64dd32.upload.maximum_data_size=8192
avrddopti.menu.chip.avr64dd32.build.highestcb=B2
avrddopti.menu.chip.avr64dd32.build.variant=32pin-ddseries
avrddopti.menu.chip.avr64dd28.build.mcu=avr64dd28
avrddopti.menu.chip.avr64dd28.bootloader.class=optiboot_64dd
avrddopti.menu.chip.avr64dd28.upload.maximum_size=65024
avrddopti.menu.chip.avr64dd28.upload.maximum_data_size=8192
avrddopti.menu.chip.avr64dd28.build.variant=28pin-ddseries
avrddopti.menu.chip.avr64dd28.build.highestcb=B2
avrddopti.menu.chip.avr64dd20.build.mcu=avr64dd20
avrddopti.menu.chip.avr64dd20.bootloader.class=optiboot_64dd
avrddopti.menu.chip.avr64dd20.upload.maximum_size=65024
avrddopti.menu.chip.avr64dd20.upload.maximum_data_size=8192
avrddopti.menu.chip.avr64dd20.build.highestcb=B1
avrddopti.menu.chip.avr64dd20.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrddopti.menu.chip.avr64dd20.build.variant=20pin-ddseries
avrddopti.menu.chip.avr64dd14.build.mcu=avr64dd14
avrddopti.menu.chip.avr64dd14.bootloader.class=optiboot_64dd14
avrddopti.menu.chip.avr64dd14.upload.maximum_size=65024
avrddopti.menu.chip.avr64dd14.upload.maximum_data_size=8192
avrddopti.menu.chip.avr64dd14.build.highestcb=B1
avrddopti.menu.chip.avr64dd14.build.variant=14pin-ddseries
avrddopti.menu.chip.avr64dd14.build.14pinled={build.altled}
avrddopti.menu.chip.avr64dd14.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrddopti.menu.chip.avr32dd32.build.mcu=avr32dd32
avrddopti.menu.chip.avr32dd32.bootloader.class=optiboot_32dd
avrddopti.menu.chip.avr32dd32.upload.maximum_size=32256
avrddopti.menu.chip.avr32dd32.upload.maximum_data_size=4096
avrddopti.menu.chip.avr32dd32.build.variant=32pin-ddseries
avrddopti.menu.chip.avr32dd28.build.mcu=avr32dd28
avrddopti.menu.chip.avr32dd28.bootloader.class=optiboot_32dd
avrddopti.menu.chip.avr32dd28.upload.maximum_size=32256
avrddopti.menu.chip.avr32dd28.upload.maximum_data_size=4096
avrddopti.menu.chip.avr32dd28.build.variant=28pin-ddseries
avrddopti.menu.chip.avr32dd20.build.mcu=avr32dd20
avrddopti.menu.chip.avr32dd20.bootloader.class=optiboot_32dd
avrddopti.menu.chip.avr32dd20.upload.maximum_size=32256
avrddopti.menu.chip.avr32dd20.upload.maximum_data_size=4096
avrddopti.menu.chip.avr32dd20.build.highestcb=B1
avrddopti.menu.chip.avr32dd20.build.variant=20pin-ddseries
avrddopti.menu.chip.avr32dd20.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrddopti.menu.chip.avr32dd14.build.mcu=avr32dd14
avrddopti.menu.chip.avr32dd14.bootloader.class=optiboot_32dd14
avrddopti.menu.chip.avr32dd14.upload.maximum_size=32256
avrddopti.menu.chip.avr32dd14.upload.maximum_data_size=4096
avrddopti.menu.chip.avr32dd14.build.highestcb=B1
avrddopti.menu.chip.avr32dd14.build.variant=14pin-ddseries
avrddopti.menu.chip.avr32dd14.build.14pinled={build.altled}
avrddopti.menu.chip.avr32dd14.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrddopti.menu.chip.avr16dd32.build.mcu=avr16dd32
avrddopti.menu.chip.avr16dd32.bootloader.class=optiboot_32dd
avrddopti.menu.chip.avr16dd32.upload.maximum_size=15872
avrddopti.menu.chip.avr16dd32.upload.maximum_data_size=2048
avrddopti.menu.chip.avr16dd32.build.variant=32pin-ddseries
avrddopti.menu.chip.avr16dd28.build.mcu=avr16dd28
avrddopti.menu.chip.avr16dd28.bootloader.class=optiboot_32dd
avrddopti.menu.chip.avr16dd28.upload.maximum_size=15872
avrddopti.menu.chip.avr16dd28.upload.maximum_data_size=2048
avrddopti.menu.chip.avr16dd28.build.variant=28pin-ddseries
avrddopti.menu.chip.avr16dd20.build.mcu=avr16dd20
avrddopti.menu.chip.avr16dd20.bootloader.class=optiboot_32dd
avrddopti.menu.chip.avr16dd20.upload.maximum_size=15872
avrddopti.menu.chip.avr16dd20.upload.maximum_data_size=2048
avrddopti.menu.chip.avr16dd20.build.highestcb=B1
avrddopti.menu.chip.avr16dd20.build.variant=20pin-ddseries
avrddopti.menu.chip.avr16dd20.build.defaultswaps=-DMUX_DEFAULT_USART1=2
avrddopti.menu.chip.avr16dd14.build.mcu=avr16dd14
avrddopti.menu.chip.avr16dd14.bootloader.class=optiboot_32dd14
avrddopti.menu.chip.avr16dd14.upload.maximum_size=15872
avrddopti.menu.chip.avr16dd14.upload.maximum_data_size=2048
avrddopti.menu.chip.avr16dd14.build.highestcb=B1
avrddopti.menu.chip.avr16dd14.build.variant=14pin-ddseries
avrddopti.menu.chip.avr16dd14.build.14pinled={build.altled}
avrddopti.menu.chip.avr16dd14.build.defaultswaps=-DMUX_DEFAULT_USART1=2


