TheEccentricGenius/PRODUINO-INK-4u-Software/boards.txt
#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
azduinoboard.menu.bodvoltage.2v85=2.85V (Recommended if powered from USB - if Vusb < 2.85V, something else is wrong)
azduinoboard.menu.bodvoltage.2v85.bootloader.bodlevbits=011
azduinoboard.menu.bodvoltage.1v9=1.9V
azduinoboard.menu.bodvoltage.1v9.bootloader.bodlevbits=000
azduinoboard.menu.bodvoltage.2v45=2.45V
azduinoboard.menu.bodvoltage.2v45.bootloader.bodlevbits=001
azduinoboard.menu.bodvoltage.2v70=2.70V
azduinoboard.menu.bodvoltage.2v70.bootloader.bodlevbits=010
azduinoboard.menu.bodmode.disabled=Disabled/Disabled
azduinoboard.menu.bodmode.enabled=Enabled/Enabled
azduinoboard.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
azduinoboard.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
azduinoboard.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
azduinoboard.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
azduinoboard.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
azduinoboard.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
azduinoboard.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
azduinoboard.menu.bodmode.disabled.bootloader.BODCFG=0x00
azduinoboard.menu.bodmode.enabled.bootloader.bodmodebits=00101
azduinoboard.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
azduinoboard.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
azduinoboard.menu.bodmode.samplefast.bootloader.bodmodebits=01010
azduinoboard.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
azduinoboard.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
azduinoboard.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
azduinoboard.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# Reset pin as input option              #
#________________________________________#
azduinoboard.menu.resetpin.reset=PF6: Reset (default boot entry on reset pin & SW resets, 1 sec timeout)
azduinoboard.menu.resetpin.reset.bootloader.defaultentrycond=_extr
azduinoboard.menu.resetpin.reset.bootloader.resetpinbits=10
azduinoboard.menu.resetpin.input=PF6: Input (default boot entry on power on & SW resets, 8 sec timeout)
azduinoboard.menu.resetpin.input.bootloader.defaultentrycond=_all_8sec
azduinoboard.menu.resetpin.input.bootloader.resetpinbits=00

#----------------------------------------#
# Optiboot Entry Conditions              #
#________________________________________#
#azduinoboard.menu.entrycond.default=Default (see documentation)
#azduinoboard.menu.entrycond.extr=External (reset pin) (see documentation)
#azduinoboard.menu.entrycond.extronly=External reset only (see documentation)
#azduinoboard.menu.entrycond.all=Always (see documentation)
#azduinoboard.menu.entrycond.poronly= Power On Only (see documentation)
#azduinoboard.menu.entrycond.swr=SW-only (see documentation)
#azduinoboard.menu.entrycond.extr_slow=External (reset pin), slow (see documentation)
#azduinoboard.menu.entrycond.default.bootloader.entrycond={bootloader.defaultentrycond}
#azduinoboard.menu.entrycond.extr.bootloader.entrycond=_extr
#azduinoboard.menu.entrycond.extronly.bootloader.entrycond=_extronly
#azduinoboard.menu.entrycond.poronly.bootloader.entrycond=_poronly_8sec
#azduinoboard.menu.entrycond.all.bootloader.entrycond=_all_8sec
#azduinoboard.menu.entrycond.swr.bootloader.entrycond=_swronly_8sec
#azduinoboard.menu.entrycond.extr_slow.bootloader.entrycond=_extr_8sec


#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
azduinoboard.menu.millis.tcb2=TCB2 (recommended)
azduinoboard.menu.millis.disabled=Disabled (delay() only)
azduinoboard.menu.millis.tcb0=TCB0
azduinoboard.menu.millis.tcb1=TCB1
azduinoboard.menu.millis.tcb3=TCB3 (48/64-pin parts only)
azduinoboard.menu.millis.tca0=TCA0
azduinoboard.menu.millis.tca1=TCA1 (48/64-pin parts only)
azduinoboard.menu.millis.tcb0.build.millistimer=B0
azduinoboard.menu.millis.tcb1.build.millistimer=B1
azduinoboard.menu.millis.tcb2.build.millistimer=B2
azduinoboard.menu.millis.tcb3.build.millistimer=B3
azduinoboard.menu.millis.tca0.build.millistimer=A0
azduinoboard.menu.millis.tca1.build.millistimer=A1
azduinoboard.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
azduinoboard.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
azduinoboard.menu.printf.full=Full, 2.6k, prints floats
azduinoboard.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
azduinoboard.menu.printf.full.build.printfabr=.pfF
azduinoboard.menu.printf.minimal=Minimal, 1.1k flash used
azduinoboard.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
azduinoboard.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#azduinoboard.menu.optimization.size=-Os (size)
#azduinoboard.menu.optimization.sizegcse=-Os (size, no GCSE)
#azduinoboard.menu.optimization.o3=-O3 (speed)
#azduinoboard.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#azduinoboard.menu.optimization.size.build.optimizationlevel=-Os
#azduinoboard.menu.optimization.sizegcse.build.optimizationlevel=-Os
#azduinoboard.menu.optimization.o3.build.optimizationlevel=-O3
#azduinoboard.menu.optimization.o3gcse.build.optimizationlevel=-O3
#azduinoboard.menu.optimization.size.build.optabr=.Os
#azduinoboard.menu.optimization.sizegcse.build.optabr=.Osng
#azduinoboard.menu.optimization.o3.build.optabr=.O3
#azduinoboard.menu.optimization.o3gcse.build.optabr=.O3ng
#azduinoboard.menu.optimization.sizegcse.build.gcse=-fno-gcse
#azduinoboard.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
azduinoboard.menu.attach.allenabled=On all pins, with new implementation.
azduinoboard.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
azduinoboard.menu.attach.manual=Only enabled ports. Please see documentation.
azduinoboard.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
azduinoboard.menu.attach.oldversion=Old version, (may fix bugs)
azduinoboard.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
azduinoboard.menu.attach.manual.build.attachabr=.aMan
azduinoboard.menu.attach.oldversion.build.attachabr=.aOld

