TheEccentricGenius/PRODUINO-INK-4u-Software/boards.txt
#----------------------------------------#
# MVIO menu                              #
#________________________________________#
azduinoboard.menu.mvioopti.enabled=Enabled
azduinoboard.menu.mvioopti.enabled.bootloader.mviobits=01
azduinoboard.menu.mvioopti.enabled.build.mvioenable=-DMVIO_ENABLED
azduinoboard.menu.mvioopti.disabled=Disabled
azduinoboard.menu.mvioopti.disabled.bootloader.mviobits=10
azduinoboard.menu.mvioopti.disabled.build.mvioenable=
azduinoboard.menu.mvioopti.reallyenabled=Enabled. Assume that "burn bootloader" has been performed with this option.
azduinoboard.menu.mvioopti.reallyenabled.bootloader.mviobits=01
azduinoboard.menu.mvioopti.reallyenabled.build.mvioenable==-DMVIO_ENABLED -DASSUME_MVIO_FUSE
azduinoboard.menu.mvioopti.reallydisabled=Disabled. Assume that "burn bootloader" has been performed with this option.
azduinoboard.menu.mvioopti.reallydisabled.bootloader.mviobits=10
azduinoboard.menu.mvioopti.reallydisabled.build.mvioenable=-DASSUME_MVIO_FUSE

#----------------------------------------#
# Startup time options                   #
#________________________________________#
azduinoboard.menu.startuptime.8=8ms
azduinoboard.menu.startuptime.0=0ms
azduinoboard.menu.startuptime.1=1ms
azduinoboard.menu.startuptime.2=2ms
azduinoboard.menu.startuptime.4=4ms
azduinoboard.menu.startuptime.16=16ms
azduinoboard.menu.startuptime.32=32ms
azduinoboard.menu.startuptime.64=64ms
azduinoboard.menu.startuptime.0.bootloader.sutbits=000
azduinoboard.menu.startuptime.1.bootloader.sutbits=001
azduinoboard.menu.startuptime.2.bootloader.sutbits=010
azduinoboard.menu.startuptime.4.bootloader.sutbits=011
azduinoboard.menu.startuptime.8.bootloader.sutbits=100
azduinoboard.menu.startuptime.16.bootloader.sutbits=101
azduinoboard.menu.startuptime.32.bootloader.sutbits=110
azduinoboard.menu.startuptime.64.bootloader.sutbits=111

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
azduinoboard.menu.wiremode.mors=1x Wire, Master or Slave (least Flash & RAM)
azduinoboard.menu.wiremode.mors.build.wiremode=MORS_SINGLE
azduinoboard.menu.wiremode.mors.build.wireabr=.wO
azduinoboard.menu.wiremode.mands=1x Wire, Master and Slave
azduinoboard.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
azduinoboard.menu.wiremode.mands.build.wireabr=.wA
azduinoboard.menu.wiremode.mors2=2x Wire, Master or Slave (not available on Nano DD)
azduinoboard.menu.wiremode.mors2.build.wiremode=MORS_BOTH
azduinoboard.menu.wiremode.mors2.build.wireabr=.wO2
azduinoboard.menu.wiremode.mands2=2x Wire, Master and Slave (not available on Nano DB)
azduinoboard.menu.wiremode.mands2.build.wiremode=MANDS_BOTH
azduinoboard.menu.wiremode.mands2.build.wireabr=.wA2


#----------------------------------------#
# WDT MODE                               #
#________________________________________#
azduinoboard.menu.WDTtimeout.disabled=Disabled (recommended)
azduinoboard.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
azduinoboard.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
azduinoboard.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
azduinoboard.menu.WDTtimeout.1second=Window remains open for 1 Second
azduinoboard.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
azduinoboard.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
azduinoboard.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
azduinoboard.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
azduinoboard.menu.WDTwindow.disabled=No delay before window "opens"
azduinoboard.menu.WDTwindow.8seconds=8 Second before window "opens"
azduinoboard.menu.WDTwindow.4seconds=4 Second before window "opens"
azduinoboard.menu.WDTwindow.2seconds=2 Second before window "opens"
azduinoboard.menu.WDTwindow.1second=1 Second before window "opens"
azduinoboard.menu.WDTwindow.500msec=500 millisecond before window "opens"
azduinoboard.menu.WDTwindow.250msec=250 millisecond before window "opens"
azduinoboard.menu.WDTwindow.125msec=125 millisecond before window "opens"
azduinoboard.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
azduinoboard.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
azduinoboard.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
azduinoboard.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
azduinoboard.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
azduinoboard.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
azduinoboard.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
azduinoboard.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
azduinoboard.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
azduinoboard.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
azduinoboard.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
azduinoboard.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
azduinoboard.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
azduinoboard.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
azduinoboard.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
azduinoboard.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
azduinoboard.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
azduinoboard.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
azduinoboard.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

#----------------------------------------#
# Flash Mapping options                  #
#________________________________________#
azduinoboard.menu.flmap.lockdefault=Use last FLMAP section, lock FLMAP, provide PROGMEM_MAPPED
azduinoboard.menu.flmap.unlocked=Start w/default, do not lock flmap. No PROGMEM_MAPPED.
azduinoboard.menu.flmap.locksection02=Set FLMAP to section 2, lock FLMAP, provide PROGMEM_MAPPED
azduinoboard.menu.flmap.locksection1=Set FLMAP to section 1, lock FLMAP, provide PROGMEM_MAPPED
azduinoboard.menu.flmap.locksection0=Set FLMAP to section 0, lock FLMAP, provide PROGMEM_MAPPED
azduinoboard.menu.flmap.lockdefault.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION3
azduinoboard.menu.flmap.unlocked.build.flmapopts=
azduinoboard.menu.flmap.locksection02.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION2
azduinoboard.menu.flmap.locksection1.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION1
azduinoboard.menu.flmap.locksection0.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION0
azduinoboard.menu.flmap.lockdefault.build.flmapabr=.fld
azduinoboard.menu.flmap.unlocked.build.flmapabr=.ful
azduinoboard.menu.flmap.locksection02.build.flmapabr=.fl2
azduinoboard.menu.flmap.locksection1.build.flmapabr=.fl1
azduinoboard.menu.flmap.locksection0.build.flmapabr=.fl0

###########################################################################################
#                                                                                         #
#  ####  ####   ###  ####  #   # ##### #   #  ###      ##### #   # #   #        #  #   #  #
#  #   # #   # #   # #   # #   #   #   ##  # #   #       #   ##  # #  #       # #  #   #  #
#  ####  ####  #   # #   # #   #   #   # # # #   #       #   # # # # #       #  #  #   #  #
#  #     #  #  #   # #   # #   #   #   #  ## #   #       #   #  ## #  #     ###### #   #  #
#  #     #   #  ###  ####   ###  ##### #   #  ###      ##### #   # #   #        #   ###   #
#_________________________________________________________________________________________#
#                                                   #
# Parameters and defaults for the PRODUINO INK 4u   #
#___________________________________________________#
produinoink4u.upload.tool=avrdude
produinoink4u.upload.prog_interlock=
produinoink4u.build.board=avrda
produinoink4u.build.core=dxcore
produinoink4u.upload.maximum_size=0
produinoink4u.upload.maximum_data_size=0
# The maximum size and data size attributes are overridden by the selected chip. If you are avoiding specifying that somehow, there is no hope of anything working, so don't do that.
# Each top-level entry supports at least a dozen parts with varying memory constraints.
produinoink4u.build.f_cpu={build.speed}000000L
produinoink4u.build.text_section_start=.text=0x0
produinoink4u.build.extra_flags= {bootloader.appspm}
produinoink4u.build.export_merged_output=false
produinoink4u.build.printf=
produinoink4u.build.flmapopts=
produinoink4u.build.attachmode=-DCORE_ATTACH_ALL

