TheEccentricGenius/PRODUINO-INK-4u-Software/boards.txt
#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
produinoink4u.bootloader.tool=avrdude
produinoink4u.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
produinoink4u.bootloader.wdtwindowbits=0000
produinoink4u.bootloader.wdttimeotbits=0000
produinoink4u.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
produinoink4u.bootloader.SYSCFG0=0b1100100{bootloader.eesavebit}
produinoink4u.bootloader.CODESIZE=0x00
produinoink4u.bootloader.BOOTSIZE=0x01
# Note that BOOTSIZE is overridden by App SPM menu's default option - this way is just less verbose.
produinoink4u.bootloader.avrdudestring=
produinoink4u.bootloader.pymcuprogstring=-aerase

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
produinoink4u.build.mcupostfix=
produinoink4u.build.printfabr=
produinoink4u.build.attachabr=
produinoink4u.build.wireabr=
produinoink4u.build.flmapabr=.ful
produinoink4u.build.appspmabr=.spm{bootloader.CODESIZE}

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DA submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
#________________________________________#
produinoink4u.menu.chip.avr128da28=AVR128DA28
produinoink4u.menu.chip.avr128da28.build.mcu=avr128da28
produinoink4u.menu.chip.avr128da28.upload.maximum_size=131072
produinoink4u.menu.chip.avr128da28.upload.maximum_data_size=16384
produinoink4u.menu.chip.avr128da28.build.variant=Produino-INK4u

#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
produinoink4u.menu.clock.24internal=24 MHz internal
produinoink4u.menu.clock.24internal.build.speed=24
produinoink4u.menu.clock.24internal.build.clocksource=0
produinoink4u.menu.clock.20internal=20 MHz internal
produinoink4u.menu.clock.20internal.build.speed=20
produinoink4u.menu.clock.20internal.build.clocksource=0
produinoink4u.menu.clock.16internal=16 MHz internal
produinoink4u.menu.clock.16internal.build.speed=16
produinoink4u.menu.clock.16internal.build.clocksource=0
produinoink4u.menu.clock.12internal=12 MHz internal
produinoink4u.menu.clock.12internal.build.speed=12
produinoink4u.menu.clock.12internal.build.clocksource=0
produinoink4u.menu.clock.10internal=10 MHz internal
produinoink4u.menu.clock.10internal.build.speed=10
produinoink4u.menu.clock.10internal.build.clocksource=0
produinoink4u.menu.clock.8internal=8 MHz internal
produinoink4u.menu.clock.8internal.build.speed=8
produinoink4u.menu.clock.8internal.build.clocksource=0
produinoink4u.menu.clock.5internal=5 MHz internal
produinoink4u.menu.clock.5internal.build.speed=5
produinoink4u.menu.clock.5internal.build.clocksource=0
produinoink4u.menu.clock.4internal=4 MHz internal
produinoink4u.menu.clock.4internal.build.speed=4
produinoink4u.menu.clock.4internal.build.clocksource=0
produinoink4u.menu.clock.1internal=1 MHz internal
produinoink4u.menu.clock.1internal.build.speed=1
produinoink4u.menu.clock.1internal.build.clocksource=0
produinoink4u.menu.clock.28internal=28 MHz internal (overclocked)
produinoink4u.menu.clock.28internal.build.speed=28
produinoink4u.menu.clock.28internal.build.clocksource=0
produinoink4u.menu.clock.32internal=32 MHz internal (overclocked)
produinoink4u.menu.clock.32internal.build.speed=32
produinoink4u.menu.clock.32internal.build.clocksource=0

#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
produinoink4u.menu.bodvoltage.1v9=1.9V
produinoink4u.menu.bodvoltage.1v9.bootloader.bodlevbits=000
produinoink4u.menu.bodvoltage.2v45=2.45V
produinoink4u.menu.bodvoltage.2v45.bootloader.bodlevbits=001
produinoink4u.menu.bodvoltage.2v70=2.70V
produinoink4u.menu.bodvoltage.2v70.bootloader.bodlevbits=010
produinoink4u.menu.bodvoltage.2v85=2.85V
produinoink4u.menu.bodvoltage.2v85.bootloader.bodlevbits=011
produinoink4u.menu.bodvoltage.rsvd1=Mystery1
produinoink4u.menu.bodvoltage.rsvd1.bootloader.bodlevbits=100
produinoink4u.menu.bodvoltage.rsvd2=Mystery2
produinoink4u.menu.bodvoltage.rsvd2.bootloader.bodlevbits=101
produinoink4u.menu.bodvoltage.rsvd3=Mystery3
produinoink4u.menu.bodvoltage.rsvd3.bootloader.bodlevbits=110
produinoink4u.menu.bodvoltage.rsvd4=Mystery4
produinoink4u.menu.bodvoltage.rsvd4.bootloader.bodlevbits=111
produinoink4u.menu.bodmode.disabled=Disabled/Disabled
produinoink4u.menu.bodmode.enabled=Enabled/Enabled
produinoink4u.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
produinoink4u.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
produinoink4u.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
produinoink4u.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
produinoink4u.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
produinoink4u.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
produinoink4u.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
produinoink4u.menu.bodmode.disabled.bootloader.BODCFG=0x00
produinoink4u.menu.bodmode.enabled.bootloader.bodmodebits=00101
produinoink4u.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
produinoink4u.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
produinoink4u.menu.bodmode.samplefast.bootloader.bodmodebits=01010
produinoink4u.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
produinoink4u.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
produinoink4u.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
produinoink4u.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# Retain EEPROM (EESAVE)                 #
#________________________________________#
produinoink4u.menu.eesave.enable=EEPROM retained
produinoink4u.menu.eesave.enable.bootloader.eesavebit=1
produinoink4u.menu.eesave.disable=EEPROM not retained
produinoink4u.menu.eesave.disable.bootloader.eesavebit=0

