TheEccentricGenius/PRODUINO-INK-4u-Software/boards.txt
#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
produinoink4u.menu.millis.tcb2=TCB2 (recommended)
produinoink4u.menu.millis.disabled=Disabled
produinoink4u.menu.millis.tcb0=TCB0
produinoink4u.menu.millis.tcb1=TCB1
produinoink4u.menu.millis.tcb0.build.millistimer=B0
produinoink4u.menu.millis.tcb1.build.millistimer=B1
produinoink4u.menu.millis.tcb2.build.millistimer=B2
produinoink4u.menu.millis.tcb3.build.millistimer=B3
produinoink4u.menu.millis.tcb4.build.millistimer=B4
produinoink4u.menu.millis.tca0.build.millistimer=A0
produinoink4u.menu.millis.tca1.build.millistimer=A1
produinoink4u.menu.millis.disabled.build.millistimer=NONE

#----------------------------------------#
# printf() version options               #
#________________________________________#
produinoink4u.menu.printf.default=Default, 1.5k flash, no floats
produinoink4u.menu.printf.full=Full, 2.6k, prints floats
produinoink4u.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
produinoink4u.menu.printf.full.build.printfabr=.pfF
produinoink4u.menu.printf.minimal=Minimal, 1.1k flash used
produinoink4u.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
produinoink4u.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
produinoink4u.menu.attach.allenabled=On all pins, with new implementation.
produinoink4u.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
produinoink4u.menu.attach.manual=Only enabled ports. Please see documentation
produinoink4u.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
produinoink4u.menu.attach.oldversion=Old version, (may fix bugs)
produinoink4u.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
produinoink4u.menu.attach.manual.build.attachabr=.aMan
produinoink4u.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# Startup time options                   #
#________________________________________#
produinoink4u.menu.startuptime.8=8ms
produinoink4u.menu.startuptime.1=0ms
produinoink4u.menu.startuptime.1=1ms
produinoink4u.menu.startuptime.2=2ms
produinoink4u.menu.startuptime.4=4ms
produinoink4u.menu.startuptime.16=16ms
produinoink4u.menu.startuptime.32=32ms
produinoink4u.menu.startuptime.64=64ms
produinoink4u.menu.startuptime.0.bootloader.SYSCFG1=0x00
produinoink4u.menu.startuptime.1.bootloader.SYSCFG1=0x01
produinoink4u.menu.startuptime.2.bootloader.SYSCFG1=0x02
produinoink4u.menu.startuptime.4.bootloader.SYSCFG1=0x03
produinoink4u.menu.startuptime.8.bootloader.SYSCFG1=0x04
produinoink4u.menu.startuptime.16.bootloader.SYSCFG1=0x05
produinoink4u.menu.startuptime.32.bootloader.SYSCFG1=0x06
produinoink4u.menu.startuptime.64.bootloader.SYSCFG1=0x07

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
produinoink4u.menu.wiremode.mors=1x Wire, Master or Slave (least Flash & RAM)
produinoink4u.menu.wiremode.mors.build.wiremode=MORS_SINGLE
produinoink4u.menu.wiremode.mors.build.wireabr=.wO
produinoink4u.menu.wiremode.mands=1x Wire, Master and Slave
produinoink4u.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
produinoink4u.menu.wiremode.mands.build.wireabr=.wA

#----------------------------------------#
# Flash Mapping options                  #
#________________________________________#
produinoink4u.menu.flmap.lockdefault=Use last FLMAP section, lock FLMAP, provide PROGMEM_MAPPED
produinoink4u.menu.flmap.unlocked=Start w/default, do not lock flmap. No PROGMEM_MAPPED.
produinoink4u.menu.flmap.locksection02=Set FLMAP to section 2, lock FLMAP, provide PROGMEM_MAPPED
produinoink4u.menu.flmap.locksection1=Set FLMAP to section 1, lock FLMAP, provide PROGMEM_MAPPED
produinoink4u.menu.flmap.locksection0=Set FLMAP to section 0, lock FLMAP, provide PROGMEM_MAPPED
produinoink4u.menu.flmap.lockdefault.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION3
produinoink4u.menu.flmap.unlocked.build.flmapopts=
produinoink4u.menu.flmap.locksection02.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION2
produinoink4u.menu.flmap.locksection1.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION1
produinoink4u.menu.flmap.locksection0.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION0
produinoink4u.menu.flmap.lockdefault.build.flmapabr=.fld
produinoink4u.menu.flmap.unlocked.build.flmapabr=.ful
produinoink4u.menu.flmap.locksection02.build.flmapabr=.fl2
produinoink4u.menu.flmap.locksection1.build.flmapabr=.fl1
produinoink4u.menu.flmap.locksection0.build.flmapabr=.fl0

#----------------------------------------#
# SPM (writing flash from app)           #
#________________________________________#
produinoink4u.menu.appspm.no=Disabled (Always use this if not writing flash from app)
produinoink4u.menu.appspm.no.bootloader.appspm=
produinoink4u.menu.appspm.no.bootloader.BOOTSIZE=0x00
produinoink4u.menu.appspm.no.build.appspmabr=
produinoink4u.menu.appspm.full=Anywhere after 0x0200 (Warning: App allowed to overwrite itself)
produinoink4u.menu.appspm.full.bootloader.appspm=-DSPM_FROM_APP=-1
produinoink4u.menu.appspm.full.build.appspmabr=.spmALL
produinoink4u.menu.appspm.16plus=Above 16k
produinoink4u.menu.appspm.16plus.bootloader.appspm=-DSPM_FROM_APP=32
produinoink4u.menu.appspm.16plus.bootloader.CODESIZE=32
produinoink4u.menu.appspm.24plus=Above 24k
produinoink4u.menu.appspm.24plus.bootloader.appspm=-DSPM_FROM_APP=48
produinoink4u.menu.appspm.24plus.bootloader.CODESIZE=48
produinoink4u.menu.appspm.32plus=Above 32k (AVR128/64 only)
produinoink4u.menu.appspm.32plus.bootloader.appspm=-DSPM_FROM_APP=64
produinoink4u.menu.appspm.32plus.bootloader.CODESIZE=64
produinoink4u.menu.appspm.48plus=Above 48k (AVR128/64 only)
produinoink4u.menu.appspm.48plus.bootloader.appspm=-DSPM_FROM_APP=96
produinoink4u.menu.appspm.48plus.bootloader.CODESIZE=96
produinoink4u.menu.appspm.56plus=Above 56k (AVR128/64 only)
produinoink4u.menu.appspm.56plus.bootloader.appspm=-DSPM_FROM_APP=112
produinoink4u.menu.appspm.56plus.bootloader.CODESIZE=112
produinoink4u.menu.appspm.60plus=Above 60k (AVR128/64 only)
produinoink4u.menu.appspm.60plus.bootloader.appspm=-DSPM_FROM_APP=120
produinoink4u.menu.appspm.60plus.bootloader.CODESIZE=120
produinoink4u.menu.appspm.64plus=Above 64k (AVR128 only)
produinoink4u.menu.appspm.64plus.bootloader.appspm=-DSPM_FROM_APP=128
produinoink4u.menu.appspm.64plus.bootloader.CODESIZE=128
produinoink4u.menu.appspm.80plus=Above 80k (AVR128 only)
produinoink4u.menu.appspm.80plus.bootloader.appspm=-DSPM_FROM_APP=160
produinoink4u.menu.appspm.80plus.bootloader.CODESIZE=160
produinoink4u.menu.appspm.96plus=Above 96k (AVR128 only)
produinoink4u.menu.appspm.96plus.bootloader.appspm=-DSPM_FROM_APP=192
produinoink4u.menu.appspm.96plus.bootloader.CODESIZE=192
produinoink4u.menu.appspm.112plus=Above 112k (AVR128 only)
produinoink4u.menu.appspm.112plus.bootloader.appspm=-DSPM_FROM_APP=224
produinoink4u.menu.appspm.112plus.bootloader.CODESIZE=224
produinoink4u.menu.appspm.120plus=Above 120k (AVR128 only)
produinoink4u.menu.appspm.120plus.bootloader.appspm=-DSPM_FROM_APP=240
produinoink4u.menu.appspm.120plus.bootloader.CODESIZE=240

