TheEccentricGenius/PRODUINO-INK-4u-Software/boards.txt
#----------------------------------------#
# WDT MODE                               #
#________________________________________#
produinoink4u.menu.WDTtimeout.disabled=Disabled (recommended)
produinoink4u.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
produinoink4u.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
produinoink4u.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
produinoink4u.menu.WDTtimeout.1second=Window remains open for 1 Second
produinoink4u.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
produinoink4u.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
produinoink4u.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
produinoink4u.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
produinoink4u.menu.WDTwindow.disabled=No delay before window "opens"
produinoink4u.menu.WDTwindow.8seconds=8 Second before window "opens"
produinoink4u.menu.WDTwindow.4seconds=4 Second before window "opens"
produinoink4u.menu.WDTwindow.2seconds=2 Second before window "opens"
produinoink4u.menu.WDTwindow.1second=1 Second before window "opens"
produinoink4u.menu.WDTwindow.500msec=500 millisecond before window "opens"
produinoink4u.menu.WDTwindow.250msec=250 millisecond before window "opens"
produinoink4u.menu.WDTwindow.125msec=125 millisecond before window "opens"
produinoink4u.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
produinoink4u.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
produinoink4u.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
produinoink4u.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
produinoink4u.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
produinoink4u.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
produinoink4u.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
produinoink4u.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
produinoink4u.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
produinoink4u.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
produinoink4u.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
produinoink4u.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
produinoink4u.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
produinoink4u.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
produinoink4u.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
produinoink4u.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
produinoink4u.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
produinoink4u.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
produinoink4u.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

########################################################################
#                                                                      #
#  ##### #   # #   #        #  #   #           ###          #          #
#    #   ##  # #  #       # #  #   #          #   #        ###  ##     #
#    #   # # # # #       #  #  #   #          #   #  ###    #          #
#    #   #  ## #  #     ###### #   #          #   #  #  #   #   ##     #
#  ##### #   # #   #        #   ###            ###   ###    #   ##     #
#______________________________________________________#_______________#
#                                                 #    #
# Parameters and defaults for the PRODUINO INK 4u #
#_________________________________________________#
produinoink4uopti.build.board=avrda
produinoink4uopti.build.core=dxcore
produinoink4uopti.upload.maximum_size=0
produinoink4uopti.upload.maximum_data_size=0
# The maximum size and data size attributes are overridden by the selected chip. If you are avoiding specifying that somehow, there is no hope of anything working, so don't do that.
# Each top-level entry supports at least a dozen parts with varying memory constraints.
produinoink4uopti.build.f_cpu={build.speed}000000L
produinoink4uopti.build.text_section_start=.text=0x200
produinoink4uopti.build.extra_flags= -DSERIAL_PORT_BOOT=Serial -DSERIAL_PORT_BOOT_PORTMUX=0 -DUSING_OPTIBOOT
produinoink4uopti.build.export_merged_output=true
produinoink4uopti.build.printf=
produinoink4uopti.build.flmapopts=
produinoink4uopti.build.attachmode=-DCORE_ATTACH_ALL

#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
produinoink4uopti.bootloader.tool=avrdude
produinoink4uopti.bootloader.defaultentrycond=_extrf
produinoink4uopti.bootloader.entrycond=_extr
produinoink4uopti.bootloader.file={runtime.platform.path}/bootloaders/hex/optiboot_ink4u_ser0{bootloader.entrycond}.hex
produinoink4uopti.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
produinoink4uopti.bootloader.wdtwindowbits=0000
produinoink4uopti.bootloader.wdttimeotbits=0000
produinoink4uopti.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
produinoink4uopti.bootloader.SYSCFG0=0b11001000
produinoink4uopti.bootloader.CODESIZE=0x00
produinoink4uopti.bootloader.BOOTSIZE=0x01
produinoink4uopti.bootloader.avrdudestring=-Uflash:w:{bootloader.file}:i
produinoink4uopti.bootloader.pymcuprogstring=-f "{bootloader.file}" -a write

#----------------------------------------#
# Upload parameters for Optiboot         #
#________________________________________#
produinoink4uopti.upload.tool=avrdude
produinoink4uopti.upload.protocol=arduino
produinoink4uopti.upload.extra_params=-D
produinoink4uopti.upload.speed=115200
produinoink4uopti.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
produinoink4uopti.build.mcupostfix=opti
produinoink4uopti.build.printfabr=
produinoink4uopti.build.flmapabr=.ful
produinoink4uopti.build.attachabr=
produinoink4uopti.build.wireabr=
produinoink4uopti.build.appspmabr=

