TheEccentricGenius/PRODUINO-INK-4u-Software/boards.txt
#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DA (Optiboot) submenu options          #
#____________________________________________#
#                                        #
# Chip (memory and pincount)             #
#________________________________________#
produinoink4uopti.menu.chip.avr128da28=AVR128DA28
produinoink4uopti.menu.chip.avr128da28.build.mcu=avr128da28
produinoink4uopti.menu.chip.avr128da28.upload.maximum_size=130560
produinoink4uopti.menu.chip.avr128da28.bootloader.class=optiboot_128dx
produinoink4uopti.menu.chip.avr128da28.upload.maximum_data_size=16384
produinoink4uopti.menu.chip.avr128da28.build.variant=Produino-INK4u

#----------------------------------------#
# Clock speed and source options         #
#________________________________________#
produinoink4uopti.menu.clock.24internal=24 MHz internal
produinoink4uopti.menu.clock.24internal.build.speed=24
produinoink4uopti.menu.clock.24internal.build.clocksource=0
produinoink4uopti.menu.clock.20internal=20 MHz internal
produinoink4uopti.menu.clock.20internal.build.speed=20
produinoink4uopti.menu.clock.20internal.build.clocksource=0
produinoink4uopti.menu.clock.16internal=16 MHz internal
produinoink4uopti.menu.clock.16internal.build.speed=16
produinoink4uopti.menu.clock.16internal.build.clocksource=0
produinoink4uopti.menu.clock.12internal=12 MHz internal
produinoink4uopti.menu.clock.12internal.build.speed=12
produinoink4uopti.menu.clock.12internal.build.clocksource=0
produinoink4uopti.menu.clock.10internal=10 MHz internal
produinoink4uopti.menu.clock.10internal.build.speed=10
produinoink4uopti.menu.clock.10internal.build.clocksource=0
produinoink4uopti.menu.clock.8internal=8 MHz internal
produinoink4uopti.menu.clock.8internal.build.speed=8
produinoink4uopti.menu.clock.8internal.build.clocksource=0
produinoink4uopti.menu.clock.5internal=5 MHz internal
produinoink4uopti.menu.clock.5internal.build.speed=5
produinoink4uopti.menu.clock.5internal.build.clocksource=0
produinoink4uopti.menu.clock.4internal=4 MHz internal
produinoink4uopti.menu.clock.4internal.build.speed=4
produinoink4uopti.menu.clock.4internal.build.clocksource=0
produinoink4uopti.menu.clock.1internal=1 MHz internal
produinoink4uopti.menu.clock.1internal.build.speed=1
produinoink4uopti.menu.clock.1internal.build.clocksource=0
produinoink4uopti.menu.clock.28internal=28 MHz internal (overclocked)
produinoink4uopti.menu.clock.28internal.build.speed=28
produinoink4uopti.menu.clock.28internal.build.clocksource=0
produinoink4uopti.menu.clock.32internal=32 MHz internal (overclocked)
produinoink4uopti.menu.clock.32internal.build.speed=32
produinoink4uopti.menu.clock.32internal.build.clocksource=0


#----------------------------------------#
# BrownOut detection (BOD) options       #
#________________________________________#
produinoink4uopti.menu.bodvoltage.1v9=1.9V
produinoink4uopti.menu.bodvoltage.1v9.bootloader.bodlevbits=000
produinoink4uopti.menu.bodvoltage.2v45=2.45V
produinoink4uopti.menu.bodvoltage.2v45.bootloader.bodlevbits=001
produinoink4uopti.menu.bodvoltage.2v70=2.70V
produinoink4uopti.menu.bodvoltage.2v70.bootloader.bodlevbits=010
produinoink4uopti.menu.bodvoltage.2v85=2.85V
produinoink4uopti.menu.bodvoltage.2v85.bootloader.bodlevbits=011
produinoink4uopti.menu.bodmode.disabled=Disabled/Disabled
produinoink4uopti.menu.bodmode.enabled=Enabled/Enabled
produinoink4uopti.menu.bodmode.ensampfast=Enabled/Sampled (128 Hz)
produinoink4uopti.menu.bodmode.ensampslow=Enabled/Sampled (32 Hz)
produinoink4uopti.menu.bodmode.sampledfast=Sampled/Sampled (128 Hz)
produinoink4uopti.menu.bodmode.sampledslow=Sampled/Sampled (32 Hz)
produinoink4uopti.menu.bodmode.sampdisfast=Sampled/Disabled (128 Hz)
produinoink4uopti.menu.bodmode.sampdisslow=Sampled/Disabled (32 Hz)
produinoink4uopti.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
produinoink4uopti.menu.bodmode.disabled.bootloader.BODCFG=0x00
produinoink4uopti.menu.bodmode.enabled.bootloader.bodmodebits=00101
produinoink4uopti.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
produinoink4uopti.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
produinoink4uopti.menu.bodmode.samplefast.bootloader.bodmodebits=01010
produinoink4uopti.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
produinoink4uopti.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
produinoink4uopti.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
produinoink4uopti.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# Optiboot Entry Conditions              #
#________________________________________#
produinoink4uopti.menu.entrycond.default=Default (see documentation)
produinoink4uopti.menu.entrycond.extr=External (reset pin) (see documentation)
produinoink4uopti.menu.entrycond.extronly=External reset only (see documentation)
produinoink4uopti.menu.entrycond.all=Always (see documentation)
produinoink4uopti.menu.entrycond.poronly= Power on only (see documentation)
produinoink4uopti.menu.entrycond.swr=SW-only: 8 second timeout (see documentation)
produinoink4uopti.menu.entrycond.extr_slow=External (reset pin), slow (see documentation)
produinoink4uopti.menu.entrycond.default.bootloader.entrycond=_extr
produinoink4uopti.menu.entrycond.extr.bootloader.entrycond=_extr
produinoink4uopti.menu.entrycond.extronly.bootloader.entrycond=_extronly
produinoink4uopti.menu.entrycond.poronly.bootloader.entrycond=_poronly_8sec
produinoink4uopti.menu.entrycond.all.bootloader.entrycond=_all_8sec
produinoink4uopti.menu.entrycond.swr.bootloader.entrycond=_swronly_8sec
produinoink4uopti.menu.entrycond.extr_slow.bootloader.entrycond=_extr_8sec

#----------------------------------------#
# millis/micros timing source            #
#________________________________________#
produinoink4uopti.menu.millis.tcb2=TCB2 (recommended)
produinoink4uopti.menu.millis.disabled=Disabled (delay() only)
produinoink4uopti.menu.millis.tcb0=TCB0
produinoink4uopti.menu.millis.tcb1=TCB1
produinoink4uopti.menu.millis.tcb3=TCB3 (48/64-pin parts only)
produinoink4uopti.menu.millis.tcb4=TCB4 (64-pin parts only)
produinoink4uopti.menu.millis.tca0=TCA0
produinoink4uopti.menu.millis.tca1=TCA1 (48/64-pin parts only)
produinoink4uopti.menu.millis.tcb0.build.millistimer=B0
produinoink4uopti.menu.millis.tcb1.build.millistimer=B1
produinoink4uopti.menu.millis.tcb2.build.millistimer=B2
produinoink4uopti.menu.millis.tcb3.build.millistimer=B3
produinoink4uopti.menu.millis.tcb4.build.millistimer=B4
produinoink4uopti.menu.millis.tca0.build.millistimer=A0
produinoink4uopti.menu.millis.tca1.build.millistimer=A1
produinoink4uopti.menu.millis.disabled.build.millistimer=NONE

