TheEccentricGenius/PRODUINO-INK-4u-Software/boards.txt
#----------------------------------------#
# printf() version options               #
#________________________________________#
produinoink4uopti.menu.printf.default=Default, 1.5k flash, no floats
produinoink4uopti.menu.printf.full=Full, 2.6k, prints floats
produinoink4uopti.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
produinoink4uopti.menu.printf.full.build.printfabr=.pfF
produinoink4uopti.menu.printf.minimal=Minimal, 1.1k flash used
produinoink4uopti.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
produinoink4uopti.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
produinoink4uopti.menu.attach.allenabled=On all pins, with new implementation.
produinoink4uopti.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
produinoink4uopti.menu.attach.manual=Only enabled ports. Please see documentation.
produinoink4uopti.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
produinoink4uopti.menu.attach.oldversion=Old version, (may fix bugs)
produinoink4uopti.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
produinoink4uopti.menu.attach.manual.build.attachabr=.aMan
produinoink4uopti.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# Startup time options                   #
#________________________________________#
produinoink4uopti.menu.startuptime.8=8ms
produinoink4uopti.menu.startuptime.1=0ms
produinoink4uopti.menu.startuptime.1=1ms
produinoink4uopti.menu.startuptime.2=2ms
produinoink4uopti.menu.startuptime.4=4ms
produinoink4uopti.menu.startuptime.16=16ms
produinoink4uopti.menu.startuptime.32=32ms
produinoink4uopti.menu.startuptime.64=64ms
produinoink4uopti.menu.startuptime.0.bootloader.SYSCFG1=0x00
produinoink4uopti.menu.startuptime.1.bootloader.SYSCFG1=0x01
produinoink4uopti.menu.startuptime.2.bootloader.SYSCFG1=0x02
produinoink4uopti.menu.startuptime.4.bootloader.SYSCFG1=0x03
produinoink4uopti.menu.startuptime.8.bootloader.SYSCFG1=0x04
produinoink4uopti.menu.startuptime.16.bootloader.SYSCFG1=0x05
produinoink4uopti.menu.startuptime.32.bootloader.SYSCFG1=0x06
produinoink4uopti.menu.startuptime.64.bootloader.SYSCFG1=0x07

#-------------------------------------#
#         Wire Mode Selection         #
# To enable TWI1 or master+slave mode #
#_____________________________________#
produinoink4uopti.menu.wiremode.mors=1x Wire, Master or Slave (least Flash & RAM)
produinoink4uopti.menu.wiremode.mors.build.wiremode=MORS_SINGLE
produinoink4uopti.menu.wiremode.mors.build.wireabr=.wO
produinoink4uopti.menu.wiremode.mands=1x Wire, Master and Slave
produinoink4uopti.menu.wiremode.mands.build.wiremode=MANDS_SINGLE
produinoink4uopti.menu.wiremode.mands.build.wireabr=.wA

#----------------------------------------#
# WDT MODE                               #
#________________________________________#
produinoink4uopti.menu.WDTtimeout.disabled=Disabled (recommended)
produinoink4uopti.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
produinoink4uopti.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
produinoink4uopti.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
produinoink4uopti.menu.WDTtimeout.1second=Window remains open for 1 Second
produinoink4uopti.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
produinoink4uopti.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
produinoink4uopti.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
produinoink4uopti.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
produinoink4uopti.menu.WDTwindow.disabled=No delay before window "opens"
produinoink4uopti.menu.WDTwindow.8seconds=8 Second before window "opens"
produinoink4uopti.menu.WDTwindow.4seconds=4 Second before window "opens"
produinoink4uopti.menu.WDTwindow.2seconds=2 Second before window "opens"
produinoink4uopti.menu.WDTwindow.1second=1 Second before window "opens"
produinoink4uopti.menu.WDTwindow.500msec=500 millisecond before window "opens"
produinoink4uopti.menu.WDTwindow.250msec=250 millisecond before window "opens"
produinoink4uopti.menu.WDTwindow.125msec=125 millisecond before window "opens"
produinoink4uopti.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
produinoink4uopti.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
produinoink4uopti.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
produinoink4uopti.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
produinoink4uopti.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
produinoink4uopti.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
produinoink4uopti.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
produinoink4uopti.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
produinoink4uopti.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
produinoink4uopti.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
produinoink4uopti.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
produinoink4uopti.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
produinoink4uopti.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
produinoink4uopti.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
produinoink4uopti.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
produinoink4uopti.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
produinoink4uopti.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
produinoink4uopti.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
produinoink4uopti.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

#----------------------------------------#
# Flash Mapping options                  #
#________________________________________#
produinoink4uopti.menu.flmap.lockdefault=Use last FLMAP section, lock FLMAP, provide PROGMEM_MAPPED
produinoink4uopti.menu.flmap.unlocked=Start w/default, do not lock flmap. No PROGMEM_MAPPED.
produinoink4uopti.menu.flmap.locksection02=Set FLMAP to section 2, lock FLMAP, provide PROGMEM_MAPPED
produinoink4uopti.menu.flmap.locksection1=Set FLMAP to section 1, lock FLMAP, provide PROGMEM_MAPPED
produinoink4uopti.menu.flmap.locksection0=Set FLMAP to section 0, lock FLMAP, provide PROGMEM_MAPPED
produinoink4uopti.menu.flmap.lockdefault.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION3
produinoink4uopti.menu.flmap.unlocked.build.flmapopts=
produinoink4uopti.menu.flmap.locksection02.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION2
produinoink4uopti.menu.flmap.locksection1.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION1
produinoink4uopti.menu.flmap.locksection0.build.flmapopts=-DLOCK_FLMAP -DFLMAPSECTION0
produinoink4uopti.menu.flmap.lockdefault.build.flmapabr=.fld
produinoink4uopti.menu.flmap.unlocked.build.flmapabr=.ful
produinoink4uopti.menu.flmap.locksection02.build.flmapabr=.fl2
produinoink4uopti.menu.flmap.locksection1.build.flmapabr=.fl1
produinoink4uopti.menu.flmap.locksection0.build.flmapabr=.fl0